JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
/******************************************************************************
  * @attention
  *
  * COPYRIGHT 2016 STMicroelectronics, all rights reserved
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied,
  * AND SPECIFICALLY DISCLAIMING THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
******************************************************************************/
/*
 *      PROJECT:   ST25R3916 firmware
 *      $Revision: $
 *      LANGUAGE:  ANSI C
 */

/*! \file
 *
 *  \author Ulrich Herrmann
 *
 *  \brief Application dispatcher
 * 
 *  This file is responsible for taking commands from USB HID stream layer,
 *  executing the proper ST25R3911 commands and returning the results over USB.
 *  As entry point start reading documentation of processCmd() function.
 *
 */
/*
******************************************************************************
* INCLUDES
******************************************************************************
*/
#include <stdint.h>
#include "dispatcher.h"
#include "st_stream.h"
#include "st25r3916.h"
#include "st25r3916_com.h"
#include "st25r3916_irq.h"
#include "st25r3916_aat.h"
#include "iso14443a.h"
#include "iso15693_3.h"
#include "iso14443_common.h"
#include "iso14443b.h"
#include "iso14443b_st25tb.h"
#include "rfal_isoDep.h"
#include "rfal_nfcv.h"
#include "led.h"
#include "logger.h"
#include "rfal_utils.h"
#include "utils.h"
#include "nfc.h"
#include "t2t.h"
#include "felica.h"
#include "topaz.h"
#include "kovio.h"
#include "ce.h"
#include "tuneAntenna.h"
#include "main.h"
#include "pac.h"


#include "rfal_rf.h"
#include "rfal_chip.h"
#include "rfal_nfcDep.h"
#include "rfal_analogConfig.h"
#include "rfal_dpo.h"
#include "rfal_iso15693_2.h"
#include "rfal_nfca.h"
#include "rfal_nfcv.h"

#include "stm32_hal_legacy.h"

/*
******************************************************************************
* DEFINES
******************************************************************************
*/
#define READ_VAL08_LE(result, type, ptr)      (result = (type) ((ptr)[0]),   (ptr)  += sizeof( uint8_t ))
#define READ_VAL16_LE(result, type, ptr)      (result = (type) ((ptr)[0] + ((ptr)[1] << 8U)),     (ptr)  += sizeof( uint16_t ) )
#define READ_VAL32_LE(result, type, ptr)      (result = (type) ((ptr)[0] + ((ptr)[1] << 8U) + ((ptr)[2] << 16U) + ((ptr)[3] << 24U)),     (ptr)  += sizeof( uint32_t ) )
#define READ_BUF(result, size, ptr)  (RFAL_MEMCPY(result, (ptr), size),    (ptr)  += size)

#define WRITE_VAL08_LE(value, type, ptr)     ( * ((ptr) ++) = ( uint8_t ) (value & 0xFF) )
#define WRITE_VAL16_LE(value, type, ptr)     ( * ((ptr) ++) = ( uint8_t ) (value & 0xFF),\
                                               * ((ptr) ++) = ( uint8_t ) ((value >>  8)& 0xFF))
#define WRITE_VAL32_LE(value, type, ptr)     ( * ((ptr) ++) = ( uint8_t ) (value & 0xFF)         ,\
                                               * ((ptr) ++) = ( uint8_t ) ((value >>  8) & 0xFF) ,\
                                               * ((ptr) ++) = ( uint8_t ) ((value >> 16) & 0xFF) ,\
                                               * ((ptr) ++) = ( uint8_t ) ((value >> 24) & 0xFF))
#define WRITE_BUF(src, size, dest)  (RFAL_MEMCPY(dest, src, size),    dest  += size)


#define  ISODEP_DEVICE_INFO_STRUCT_SIZE  31U
#define  ISODEP_POLL_A_STRUCT_SIZE  (20U + ISODEP_DEVICE_INFO_STRUCT_SIZE)
#define  ISODEP_POLL_B_STRUCT_SIZE  (34U + ISODEP_DEVICE_INFO_STRUCT_SIZE)

#define PERSISTENT_ANALOG_CONFIG_WRITE 0
#define PERSISTENT_ANALOG_CONFIG_ERASE 1
#define PERSISTENT_ANALOG_CONFIG_CRC   2

/*! Command codes for NFC protocol. */
enum nfcCommand
{
    NFC_CMD_INITIALIZE                    = 0xC0,
    NFC_CMD_TX_NBYTES                     = 0xC1,
    NFC_CMD_RX_NBYTES                     = 0xC2,
    NFC_CMD_RFU1                          = 0xC3,
    NFC_CMD_SET_TXBITRATE                 = 0xC4,
    NFC_CMD_SET_RXBITRATE                 = 0xC5,
    NFC_CMD_NFCDEP_TX                     = 0xC6,
    NFC_CMD_NFCDEP_RX                     = 0xC7,
    NFC_CMD_NFCDEP_INIT_HANDLEACTIVATION  = 0xC8,
    NFC_CMD_NFCDEP_DESELECT               = 0xC9,
    NFC_CMD_NFCDEP_TARG_SETPARAMS         = 0xCA,
    NFC_CMD_NFCDEP_ATR                    = 0xCB,
    NFC_CMD_RFU2                          = 0xCC,
    NFC_CMD_NFCDEP_PSL                    = 0xCD,
    NFC_CMD_NFCDEP_TARG_HANDLEACTIVATION  = 0xCE,
    NFC_CMD_DEINITIALIZE                  = 0xCF
};

/*! Command codes for RFAL access. */
enum rfalCommand
{
    RFAL_CMD_INITIALIZE                        = 0x40,
    RFAL_CMD_CALIBRATE                         = 0x41,
    RFAL_CMD_DEINITIALIZE                      = 0x42,
    RFAL_CMD_SET_MODE                          = 0x43,
    RFAL_CMD_GET_MODE                          = 0x44,
    RFAL_CMD_SET_BITRATE                       = 0x45,
    RFAL_CMD_GET_BITRATE                       = 0x46,
    RFAL_CMD_SET_FDTPOLL                       = 0x47,
    RFAL_CMD_GET_FDTPOLL                       = 0x48,
    RFAL_CMD_SET_FDTLISTEN                     = 0x49,
    RFAL_CMD_GET_FDTLISTEN                     = 0x4A,
    RFAL_CMD_SET_GT                            = 0x4B,
    RFAL_CMD_GET_GT                            = 0x4C,
    RFAL_CMD_FIELDON_STARTGT                   = 0x4D,
    RFAL_CMD_FIELDOFF                          = 0x4E,
    RFAL_CMD_START_TXRX                        = 0x4F,
    RFAL_CMD_GET_TXRX_STATUS                   = 0x50,
    RFAL_CMD_ISO14443_TXRX_SHORTFRAME          = 0x51,
    RFAL_CMD_ISO14443_TXRX_ANTICOLLISION       = 0x52,
    RFAL_CMD_FELICA_POLL                       = 0x53,
    RFAL_CMD_ISO15693_TXRX_ANTICOLLISION       = 0x54,
    RFAL_CMD_ISO15693_TXRX_ANTICOLLISION_EOF   = 0x55,
    RFAL_CMD_ISO15693_TXRX_EOF                 = 0x56,
    RFAL_CMD_BLOCKING_TX                       = 0x57,
    RFAL_CMD_BLOCKING_RX                       = 0x58,
    RFAL_CMD_BLOCKING_TXRX                     = 0x59,

