JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
    RFAL_CMD_DPO_READ                          = 0x5A,
    RFAL_CMD_DPO_WRITE                         = 0x5B,
    RFAL_CMD_DPO_MEASURE_FUNC                  = 0x5C,
    RFAL_CMD_DPO_ADJUST_AND_MEASURE            = 0x5D,
    RFAL_CMD_DPO_SET_ENABLED                   = 0x5E,
    RFAL_CMD_DPO_IS_ENABLED                    = 0x5F,

    RFAL_CHIP_CMD_SET_RFO                      = 0x60,
    RFAL_CHIP_CMD_GET_RFO                      = 0x61,
    RFAL_CHIP_CMD_WAKEUP_START                 = 0x62,
    RFAL_CHIP_CMD_WAKEUP_HASWOKE               = 0x63,
    RFAL_CHIP_CMD_WAKEUP_GETINFO               = 0x64,
    RFAL_CHIP_CMD_WAKEUP_STOP                  = 0x65,

    RFAL_CMD_AC_SET                            = 0x66,
    RFAL_CMD_DPO_GET_CURRENT_TABLE_ENTRY       = 0x67U,    /*!< DPO Get current table index */
    
    RFAL_CMD_GET_TRANSCEIVE_RSSI               = 0x70,
};
enum IsodepCommand
{
	ISODEP_CMD_EXTENSION1                     = 0X100,
	ISODEP_CMD_INITIALIZE                     = ISODEP_CMD_EXTENSION1 + 0x00,
	ISODEP_CMD_INITIALIZEWITHPARAMS           = ISODEP_CMD_EXTENSION1 + 0x01,
	ISODEP_CMD_DESELECT                       = ISODEP_CMD_EXTENSION1 + 0x02,
	ISODEP_CMD_ATTRIB                         = ISODEP_CMD_EXTENSION1 + 0x03,
	ISODEP_CMD_FSXI2FSX                       = ISODEP_CMD_EXTENSION1 + 0x04,
	ISODEP_CMD_FWI2FWT                        = ISODEP_CMD_EXTENSION1 + 0x05,
	ISODEP_CMD_GETAPDUTRANSCEIVESTATUS        = ISODEP_CMD_EXTENSION1 + 0x06,
	ISODEP_CMD_GETMAXINFLEN                   = ISODEP_CMD_EXTENSION1 + 0x07,
	ISODEP_CMD_GETTRANSCEIVESTATUS            = ISODEP_CMD_EXTENSION1 + 0x08,
	ISODEP_CMD_ISATTRIB                       = ISODEP_CMD_EXTENSION1 + 0x09,
	ISODEP_CMD_ISRATS                         = ISODEP_CMD_EXTENSION1 + 0x0A,
	ISODEP_CMD_LISTENGETACTIVATIONSTATUS      = ISODEP_CMD_EXTENSION1 + 0x0B,
	ISODEP_CMD_LISTENSTARTACTIVATION          = ISODEP_CMD_EXTENSION1 + 0x0C,
	ISODEP_CMD_PPS                            = ISODEP_CMD_EXTENSION1 + 0x0D,
	ISODEP_CMD_POLLAHANDLEACTIVATION          = ISODEP_CMD_EXTENSION1 + 0x0E,
	ISODEP_CMD_POLLBHANDLEACTIVATION          = ISODEP_CMD_EXTENSION1 + 0x0F,
	ISODEP_CMD_POLLHANDLESPARAMETERS          = ISODEP_CMD_EXTENSION1 + 0x10,
	ISODEP_CMD_RATS                           = ISODEP_CMD_EXTENSION1 + 0x11,
	ISODEP_CMD_STARTAPDUTRANSCEIVE            = ISODEP_CMD_EXTENSION1 + 0x12,
	ISODEP_CMD_STARTTRANSCEIVE                = ISODEP_CMD_EXTENSION1 + 0x13,

    CMD_EXT_PERSISTENT_ANALOG_CONFIG          = ISODEP_CMD_EXTENSION1 + 0x21,
	ISODEP_CMD_COMMANDS                       = 0X7F,

    CMD_APPL_COM_WUPA                         = 0xE3, /*!< EMV TTA L1 WUPA button pressed. */
    CMD_APPL_COM_WUPB                         = 0xE4, /*!< EMV TTA L1 WUPB button pressed. */

};


enum
{
    CRC_FormatMask     = 0x0F,
    CRC_16bits         = 0x00,
    CRC_32bits_FNV1a   = 0x01,

    CRC_Original = 0x10,
    CRC_Stored   = 0x20,
    CRC_Current  = 0x40,
    CRC_GUI      = 0x80,
};

extern uint8_t rfalDpoGetCurrentTableIndex( void );

/*
******************************************************************************
* LOCAL VARIABLES
******************************************************************************
*/
static uint32_t counter = 0;

static uint8_t nfc_is_active;
static uint8_t nfc_is_initiator;
static uint8_t nfc_bitrate;
static uint8_t nfc_lmMask;
static uint8_t first_command_received;

static uint8_t                 gRxBuf[1024];             /* rx buffer used only for rfal non blocking TxRx or general functions */
static uint16_t                gRcvdLen;                 /* rx length used only for rfal non blocking TxRx */
// Use for Isodep
static rfalIsoDepApduBufFormat gIsoDepApduBuffer;        /* Buffer dedicated to apdu */
static bool                    gIsoDepTransceiveOngoing; /* On going flag for APDU tranceive */
static ReturnCode              gIsoDepTransceiveError;   /* status of APDU transceive        */


/*
******************************************************************************
* GLOBAL CONSTANTS
******************************************************************************
*/

/*
******************************************************************************
* LOCAL FUNCTION PROTOTYPES
******************************************************************************
*/
static ReturnCode processDirectCommand(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
static ReturnCode processKovio(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
static ReturnCode processTopaz(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
static ReturnCode processIso14443a(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
static ReturnCode processIso14443b(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
static ReturnCode processNfc(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
static ReturnCode processIso15693     (const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
static ReturnCode processFeliCa       (const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
static ReturnCode processIsoDep       (const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
static ReturnCode processCardEmulation(const uint8_t *rxData, const uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
static ReturnCode processDefault      (const uint8_t *rxData, const uint16_t rxSize, uint8_t *txData, uint16_t *txSize);
/*
******************************************************************************
* GLOBAL FUNCTIONS
******************************************************************************
*/

/*!
  Process the different protocols provided via \ref usb_hid_stream_driver.h. This function
  also cares for implicit deinitialisation/initialisation if necessary.
  Actuals commands are implemented in
  - #processTopaz()
  - #processIso14443a()
  - #processIso14443b()
  - #processIso15693()
  - #processNfc()
  - #processFeliCa()
  - #processT2T()
  \param rxData : forward from applProcessCmd()
  \param rxSize : forward from applProcessCmd()
  \param txData : forward from applProcessCmd()
  \param txSize : forward from applProcessCmd()
  */
uint8_t processProtocols ( const uint8_t * rxData, uint16_t rxSize, uint8_t * txData, uint16_t *txSize)
{
    static uint8_t protocol = 0;
    uint8_t cmd = *rxData;
    ReturnCode err = RFAL_ERR_REQUEST;
    uint8_t subcmd  = cmd & 0x0f;
    uint8_t newprot = cmd & 0xf0;

    if (newprot != protocol)
    {
        bool deInit = true;
        if ((protocol & 0xf0) == 0x80)
        { /* kovio barcode commands */
            err = kovioDeinitialize(0);
        }
        else if ((protocol & 0xf0) == 0x90)
        { /* topaz commands */
            err = topazDeinitialize(0);
        }
        else if ((protocol & 0xf0) == 0xa0)
        { /* iso14443a+ T2T commands */
            err = iso14443ADeinitialize(0);
        }
        else if ((protocol & 0xf0) == 0xb0)
        { /* iso14443a+ T2T commands */
            err = iso14443BDeinitialize(0);
        }
        else if ((protocol & 0xf0) == 0xc0)
        { /* nfc commands */
            err = nfcDeinitialize();
        }
        else if ((protocol & 0xf0) == 0xd0)
        { /* iso15693 commands */
            err = iso15693Deinitialize(0);
        }
        else if ((protocol & 0xf0) == 0xf0)
        { /* felica commands */
            err = felicaDeinitialize(0);
        }
        else
        {
            deInit = false;
        }
        if (deInit == true)
        {
            platformDelay(10);
        }

        if (subcmd != 0x0)
        { /* if not an initialize reuse last config */
            if ((cmd & 0xf0) == 0x80)
            { /* kovio commands */
                err = kovioInitialize();
            }
            else if ((cmd & 0xf0) == 0x90)
            { /* topaz commands */
                err = topazInitialize();
            }
            else if ((cmd & 0xf0) == 0xa0)
            { /* iso14443a + T2T commands */
                err = iso14443AInitialize();
            }
            else if ((cmd & 0xf0) == 0xb0)
            { /* iso14443a + T2T commands */
                err = iso14443BInitialize();
            }
            else if ((cmd & 0xf0) == 0xc0)
            { /* nfc commands */
                err = nfcInitialize(nfc_is_active, nfc_is_initiator, nfc_bitrate, nfc_lmMask);
            }
            else if ((cmd & 0xf0) == 0xd0)
            { /* iso15693 commands */
                err = iso15693Initialize( false, false );
            }
            else if ((cmd & 0xf0) == 0xf0)
            { /* FeliCa commands */
                err = felicaInitialize();
            }
        }
    }

