JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
  -  RFAL Field On and Start GT
    <table>
      <tr><th>   Byte</th> <th>0</th> </tr>
      <tr><th>Content</th><td>0x4D(ID)</td> </tr>
    </table>
     txSize must be >=2, returns status RFAL_ERR_NONE if no error was identified.

  -  RFAL Field Off
    <table>
      <tr><th>   Byte</th> <th>0</th> </tr>
      <tr><th>Content</th><td>0x4E(ID)</td> </tr>
    </table>
     txSize must be >=2, returns status RFAL_ERR_NONE if no error was identified.

  -  RFAL Start Transceive
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1..2</th> <th>3..3+txLen</th> <th>3+txLen+1 .. 3+txLen+4</th> <th>3+txLen+5 .. 3+txLen+8</th> </tr>
      <tr><th>Content</th><td>0x4F(ID)</td> <td>txLen</td> <td>txData</td> <td>flags</td> <td>FWT</td>  </tr>
    </table>
     returns status RFAL_ERR_NONE if no error was identified.

  -  RFAL Get Transceive Status
    <table>
      <tr><th>   Byte</th> <th>0</th> </tr>
      <tr><th>Content</th><td>0x50(ID)</td> </tr>
    </table>
     txSize must be >=2, returns status RFAL_ERR_NONE if no error was identified and response is:
    <table>
      <tr><th>   Byte</th><th>    0..1  </th><th> 2..2+rxLen </th></tr>
      <tr><th>Content</th><td>rxLen</td><td>rxData</td></tr>
    </table>

  -  RFAL Transceive ISO14443A Short Frame
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1</th> <th>2..5</th> </tr>
      <tr><th>Content</th><td>0x51(ID)</td> <td>command(REQA/WUPA)</td> <td>FWT</td> </tr>
    </table>
     returns status RFAL_ERR_NONE if no error was identified and response is:
    <table>
      <tr><th>   Byte</th> <th>0..1 </th> <th> 2..2+rxLen </th></tr>
      <tr><th>Content</th> <td>rxLen</td> <td>rxData      </td> </tr>
    </table>

  -  RFAL Transceive ISO14443A Anticollision Frame
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1</th> <th>2</th> <th>3..6</th> <th>7..txLen</th> </tr>
      <tr><th>Content</th><td>0x52(ID)</td> <td>bytesToSend</td> <td>bitsToSend</td> <td>FWT</td> <td>txData</td> </tr>
    </table>
     returns status RFAL_ERR_NONE if no error was identified and response is:
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1</th> <th>2..3</th> <th>4..4+rxLength</th> </tr>
      <tr><th>Content</th> <td>bytesReceived</td> <td>bitsReceived</td> <td>rxLength</td> <td>rxData      </td> </tr>
    </table>

  -  RFAL FeliCa Poll
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1</th> <th>2..3</th> <th>4</th> <th>5</th> </tr>
      <tr><th>Content</th><td>0x53(ID)</td> <td>numSlots</td> <td>SystemCode</td> <td>RequestCode</td> <td>PollResListSize</td> </tr>
    </table>
     returns status RFAL_ERR_NONE if no error was identified and response is:
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1</th> <th>2..3</th> <th>4..4+rxLength</th> </tr>
      <tr><th>Content</th> <td>devicesDetected</td> <td>CollisionsDetected</td> <td>PollResList</td> <td>rxData      </td> </tr>
    </table>

  -  RFAL ISO15693 Transceive Anticollision Frame
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1</th> <th>2..2+txLen</th> </tr>
      <tr><th>Content</th><td>0x54(ID)</td> <td>txLength</td> <td>txData</td> </tr>
    </table>
     returns status RFAL_ERR_NONE if no error was identified and response is:
    <table>
      <tr><th>   Byte</th><th>0..1 </th> <th> 2..2+rxLen </th></tr>
      <tr><th>Content</th><td>rxLen</td> <td>rxData</td> </tr>
    </table>

  -  RFAL ISO15693 Transceive Anticollision EOF
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1</th>  </tr>
      <tr><th>Content</th> <td>0x55(ID)</td> </tr>
    </table>
     returns status RFAL_ERR_NONE if no error was identified and response is:
    <table>
      <tr><th>   Byte</th><th>0..1 </th> <th> 2..2+rxLen </th></tr>
      <tr><th>Content</th><td>rxLen</td> <td>rxData</td> </tr>
    </table>

  -  RFAL ISO15693 Transceive EOF
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1</th>  </tr>
      <tr><th>Content</th> <td>0x56(ID)</td> </tr>
    </table>
     returns status RFAL_ERR_NONE if no error was identified and response is:
    <table>
      <tr><th>   Byte</th><th>0..1 </th> <th> 2..2+rxLen </th></tr>
      <tr><th>Content</th><td>rxLen</td> <td>rxData</td> </tr>
    </table>

  -  RFAL Transceive Blocking Tx
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1..2</th> <th>3..3+txLen</th> <th>3+txLen+1 .. 3+txLen+4</th> <th>3+txLen+5 .. 3+txLen+8</th> </tr>
      <tr><th>Content</th><td>0x57(ID)</td> <td>txLen</td> <td>txData</td> <td>flags</td> <td>FWT</td>  </tr>
    </table>
     returns status RFAL_ERR_NONE if no error was identified.

  -  RFAL Transceive Blocking Tx
    <table>
      <tr><th>   Byte</th> <th>0</th> </tr>
      <tr><th>Content</th><td>0x58(ID)</td> </tr>
    </table>
     txSize must be >=2, returns status RFAL_ERR_NONE if no error was identified and response is:
    <table>
      <tr><th>   Byte</th><th>    0..1  </th><th> 2..2+rxLen </th></tr>
      <tr><th>Content</th><td>rxLen</td><td>rxData</td></tr>
    </table>

  -  RFAL Transceive Blocking TxRx
    <table>
      <tr><th>   Byte</th> <th>0</th> <th>1..2</th> <th>3..3+txLen</th> <th>3+txLen+1 .. 3+txLen+4</th> <th>3+txLen+5 .. 3+txLen+8</th> <th>3+txLen+9 .. 3+txLen+10</th> </tr>
      <tr><th>Content</th><td>0x59(ID)</td> <td>txLen</td> <td>txData</td> <td>flags</td> <td>FWT</td> <td>rxBufSize</td> </tr>
    </table>
     returns status RFAL_ERR_NONE if no error was identified and response is:
    <table>
      <tr><th>   Byte</th><th>    0..1  </th><th> 2..2+rxLen </th></tr>
      <tr><th>Content</th><td>rxLen</td><td>rxData</td></tr>
    </table>

  */
static uint8_t processCmd ( const uint8_t * rxData, uint16_t rxSize, uint8_t * txData, uint16_t *txSize)
{
    uint8_t cmd = *rxData;
    const uint8_t *buf = rxData + 1;
    uint16_t bufSize = rxSize - 1;
    uint8_t err = (uint8_t)RFAL_ERR_REQUEST;

    if (41 != first_command_received)
    {
      platformLedOff(PLATFORM_LED_FIELD_PORT, PLATFORM_LED_FIELD_PIN);
      ledOff(LED_A);
      ledOff(LED_B);
      ledOff(LED_F);
      ledOff(LED_V);
      ledOff(LED_AP2P);
      first_command_received = 41;
    }

