JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
    if (cmd == 0x15) /* Process Direct commands */
    {
       err = processDirectCommand(buf, bufSize, txData, txSize);
    }
    if (cmd == 0x17) /* Set RFAL observation mode */
    {
        rfalSetObsvMode( buf[0], buf[1] );
        if (*txSize) *txSize = 0;
        err = RFAL_ERR_NONE;
    }
    if (cmd ==  0x18) /* ISO14443 tranceive */
    {
        uint32_t us;
        uint16_t actlength = 0;
        if (*txSize < 4) return (uint8_t)RFAL_ERR_PARAM;
        timerStopwatchStart();
        err = iso14443TransmitAndReceive(buf,
                bufSize,
                txData + 4,
                *txSize - 4,
                &actlength,
                21186);
        us = timerStopwatchMeasure();
        txData[0] = (us >>  0) & 0xff;
        txData[1] = (us >>  8) & 0xff;
        txData[2] = (us >> 16) & 0xff;
        txData[3] = (us >> 24) & 0xff;
        if (*txSize) *txSize = actlength + 4;
    }

    if (cmd == 0x19) /* tune antenna */  
    if (bufSize == 14)
    {
        tuningParams_t tuningParams;
        tuningStatus_t tuningStatus;
        
        tuningParams.mode             = (tuningAlgorithmMode_t)buf[0];
        tuningParams.AAT_A_first      = buf[1];
        tuningParams.AAT_B_first      = buf[2];
        tuningParams.AAT_A_last       = buf[3];
        tuningParams.AAT_B_last       = buf[4];
        tuningParams.AAT_A_stepWidth  = buf[5];
        tuningParams.AAT_B_stepWidth  = buf[6];
        tuningParams.phaTarget        = buf[7];
        tuningParams.phaWeight        = buf[8];
        tuningParams.ampTarget        = buf[9];
        tuningParams.ampWeight        = buf[10];

        timerStopwatchStart();
        err = tuneAntenna(&tuningParams, &tuningStatus);
        uint16_t duration = timerStopwatchMeasure();

        //
        txData[0] = (tuningStatus.AAT_A_tuned);
        txData[1] = (tuningStatus.AAT_B_tuned);
        txData[2] = (tuningStatus.phaTuned);
        txData[3] = (tuningStatus.ampTuned);
        txData[4] = 0;
        
        txData[6] = (tuningStatus.measureCnt) >> 8; 
        txData[5] = (tuningStatus.measureCnt);       
        
        txData[8] = duration >> 8; 
        txData[7] = duration;
        
        if(*txSize)
            *txSize = 5 + 2 + 2;
                
        return err;
    }
    if (0x19 == cmd) /* tune antenna - new rfal functions */
        if (15 <= bufSize)
    {
        struct st25r3916AatTuneParams tuningParams;
        struct st25r3916AatTuneResult tuningStatus;

        //unsigned char keepFieldOn     = st25r3916IsTxEnabled();
        tuningParams.aat_a_min        = buf[0];
        tuningParams.aat_a_max        = buf[1];
        tuningParams.aat_a_start      = buf[2];
        tuningParams.aat_a_stepWidth  = buf[3];
        tuningParams.aat_b_min        = buf[4];
        tuningParams.aat_b_max        = buf[5];
        tuningParams.aat_b_start      = buf[6];
        tuningParams.aat_b_stepWidth  = buf[7];
        tuningParams.phaTarget        = buf[8];
        tuningParams.phaWeight        = buf[9];
        tuningParams.ampTarget        = buf[10];
        tuningParams.ampWeight        = buf[11];
        tuningParams.doDynamicSteps   = buf[12];
        tuningParams.measureLimit     = buf[13] | (buf[14]<<8);

        timerStopwatchStart();
        err = st25r3916AatTune(&tuningParams, &tuningStatus);
        uint16_t duration = timerStopwatchMeasure();

        //
        txData[0] = (tuningStatus.aat_a);
        txData[1] = (tuningStatus.aat_b);
        txData[2] = (tuningStatus.pha);
        txData[3] = (tuningStatus.amp);
        txData[4] = 0;

        txData[6] = (tuningStatus.measureCnt) >> 8;
        txData[5] = (tuningStatus.measureCnt);

        txData[8] = duration >> 8;
        txData[7] = duration;

        if(*txSize)
            *txSize = 5 + 2 + 2;

        return err;
    }

    if (cmd == 0x20) /* Antenna measurement. */
    {
        st25r3916MeasureAmplitude(txData);
        st25r3916MeasurePhase(txData + 1);
        if (*txSize) *txSize = 2;
        err = RFAL_ERR_NONE;
    }
    if (cmd == 0x21) /* Get interrupt and result */
    { 
        err = RFAL_ERR_REQUEST; // was: processInterruptResult( buf, bufSize, txData, txSize);
    }
    if (cmd == 0x22) /* Turn on/off antenna */
    { 
        if (bufSize < 1) return (uint8_t)RFAL_ERR_PARAM;
        if( buf[0] != 0x00 )
        {
            rfalSetGT( RFAL_TIMING_NONE );
            err = rfalFieldOnAndStartGT();
        }
        else
        {
          rfalFieldOff();
          err = RFAL_ERR_NONE;
        }
        if (*txSize) *txSize = 0;
    }
    if (cmd == 0x23) /* Get RFAL observation mode state */
    {
        rfalGetObsvMode( &txData[0], &txData[1] );
        if (*txSize) *txSize = 2;
        err = RFAL_ERR_NONE;
    }
    if (cmd == 0x24) /* Identify */
    {
      /* Direction: >> */
      for(uint8_t i = 0; i < 6; i++)
      {
          if(i == 0) platformLedOn(PLATFORM_LED_FIELD_PORT, PLATFORM_LED_FIELD_PIN); else platformLedOff(PLATFORM_LED_FIELD_PORT, PLATFORM_LED_FIELD_PIN);
          (i == 1) ? ledOn(LED_A) : ledOff(LED_A);
          (i == 2) ? ledOn(LED_B) : ledOff(LED_B);
          (i == 3) ? ledOn(LED_F) : ledOff(LED_F);
          (i == 4) ? ledOn(LED_V) : ledOff(LED_V);
          (i == 5) ? ledOn(LED_AP2P) : ledOff(LED_AP2P);
          HAL_Delay(70);
      }
      /* Direction: << */
      for(uint8_t i = 0; i < 6; i++)
      {
          if(i == 5) platformLedOn(PLATFORM_LED_FIELD_PORT, PLATFORM_LED_FIELD_PIN); else platformLedOff(PLATFORM_LED_FIELD_PORT, PLATFORM_LED_FIELD_PIN);
          (i == 4) ? ledOn(LED_A) : ledOff(LED_A);
          (i == 3) ? ledOn(LED_B) : ledOff(LED_B);
          (i == 2) ? ledOn(LED_F) : ledOff(LED_F);
          (i == 1) ? ledOn(LED_V) : ledOff(LED_V);
          (i == 0) ? ledOn(LED_AP2P) : ledOff(LED_AP2P);
          HAL_Delay(70);
      }
      platformLedOff(PLATFORM_LED_FIELD_PORT, PLATFORM_LED_FIELD_PIN);

      if (*txSize) *txSize = 0;
      err = RFAL_ERR_NONE;
    }
    if (cmd == 0x25) /* Get MCU UID */
    {
        int i;
        if (*txSize > 12) *txSize = 12;
        for ( i = 0; i<*txSize; i++)
        {
            txData[i] = ((uint8_t*)UID_BASE)[i];
        }
        err = RFAL_ERR_NONE;
    }
    if (cmd == 0x26) /* RFAL read analogue config */
    {
        err = rfalAnalogConfigListReadRaw(txData, *txSize, txSize);
    }
    if (cmd == 0x27) /* RFAL write analogue config */
    {
        rfalDeinitialize();
        err = rfalAnalogConfigListWriteRaw(buf, bufSize);
        rfalInitialize();
        rfalSetPreTxRxCallback( rfalPreTransceiveCb ); /* Restore callback cleared by rfalInitialize()*/
    }

    // ----------------------------------------------------------------------
    // - Group: Card emulation ----------------------------------------------
    // ----------------------------------------------------------------------
    if (cmd == 0x30) /* Process Card emulation */  
    {         
        err = processCardEmulation(rxData, rxSize, txData, txSize);
    }
    
    // ----------------------------------------------------------------------
    // - Group: RFAL cmds ---------------------------------------------------
    // ----------------------------------------------------------------------
    if (cmd == RFAL_CMD_INITIALIZE)
    {
        err = rfalInitialize();
        rfalSetPreTxRxCallback( rfalPreTransceiveCb );
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_CALIBRATE)
    {
        err = rfalCalibrate();
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_DEINITIALIZE)
    {
        err = rfalDeinitialize();
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_SET_MODE)
    {
        err = rfalSetMode( (rfalMode)buf[0], (rfalBitRate)buf[1], (rfalBitRate)buf[2] );
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_SET_BITRATE)
    {
        err = rfalSetBitRate( (rfalBitRate)buf[0], (rfalBitRate)buf[1] );
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_SET_FDTPOLL)
    {
        rfalSetFDTPoll( (uint32_t) ( (buf[0] << 24) | (buf[1] << 16) | (buf[2] << 8) | buf[3] ) );
        err = RFAL_ERR_NONE;
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_SET_FDTLISTEN)
    {
        rfalSetFDTListen( (uint32_t) ( (buf[0] << 24) | (buf[1] << 16) | (buf[2] << 8) | buf[3] ) );
        err = RFAL_ERR_NONE;
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_SET_GT)
    {
        rfalSetGT( (uint32_t) ( (buf[0] << 24) | (buf[1] << 16) | (buf[2] << 8) | buf[3] ) );
        err = RFAL_ERR_NONE;
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_FIELDON_STARTGT)
    {
        err = rfalFieldOnAndStartGT();
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_FIELDOFF)
    {
        err = rfalFieldOff();
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_BLOCKING_TXRX)
    {
        uint16_t txLen;
        uint32_t flags;
        uint32_t fwt;
        uint16_t rcvdLen;

        txLen = ((buf[0]<<8) | buf[1]);
        flags = ((buf[2+txLen+0]<<24) | (buf[2+txLen+1]<<16) | (buf[2+txLen+2]<<8) | (buf[2+txLen+3]) );
        fwt   = ((buf[2+txLen+4+0]<<24) | (buf[2+txLen+4+1]<<16) | (buf[2+txLen+4+2]<<8) | (buf[2+txLen+4+3]) );

        err = rfalTransceiveBlockingTxRx( (uint8_t*)&buf[2], txLen, &txData[2], (*txSize - 2), &rcvdLen, flags, fwt );

        txData[0] = ((rcvdLen>>8)&0xFF);
        txData[1] = ((rcvdLen>>0)&0xFF);

