JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
        if (*txSize) *txSize = (2 + MIN( rcvdLen, (*txSize - 2)) );
    }
    if (cmd == RFAL_CMD_BLOCKING_TX)
    {
        uint16_t txLen;
        uint32_t flags;
        uint32_t fwt;

        gRcvdLen = 0;
        txLen    = ((buf[0]<<8) | buf[1]);
        flags    = ((buf[2+txLen+0]<<24) | (buf[2+txLen+1]<<16) | (buf[2+txLen+2]<<8) | (buf[2+txLen+3]) );
        fwt      = ((buf[2+txLen+4+0]<<24) | (buf[2+txLen+4+1]<<16) | (buf[2+txLen+4+2]<<8) | (buf[2+txLen+4+3]) );

        err = rfalTransceiveBlockingTx( (uint8_t*)&buf[2], txLen, gRxBuf, sizeof(gRxBuf), &gRcvdLen, flags, fwt );
        if (*txSize) *txSize = 0;
    }
    if (cmd == RFAL_CMD_BLOCKING_RX)
    {
        err = rfalTransceiveBlockingRx();

        if( err != RFAL_ERR_BUSY )
        {
            RFAL_MEMCPY( (uint8_t*)&txData[2], gRxBuf, rfalConvBitsToBytes(gRcvdLen) );
        }
        txData[0] = ((gRcvdLen>>8)&0xFF);
        txData[1] = ((gRcvdLen>>0)&0xFF);

        if (*txSize) *txSize = (2 + MIN( rfalConvBitsToBytes(gRcvdLen), sizeof(gRxBuf)) );
    }
    if (cmd == RFAL_CMD_START_TXRX)
    {
        rfalTransceiveContext ctx;
        uint16_t              txLen;

        gRcvdLen = 0;
        txLen    = ((buf[0]<<8) | buf[1]);

        ctx.txBuf     = (uint8_t*)&buf[2];
        ctx.txBufLen  = txLen;
        ctx.rxBuf     = gRxBuf;
        ctx.rxBufLen  = rfalConvBytesToBits( sizeof(gRxBuf) );
        ctx.rxRcvdLen = &gRcvdLen;
        txLen         = rfalConvBitsToBytes(txLen);
        ctx.flags     = ((buf[2+txLen+0]<<24) | (buf[2+ txLen+1]<<16) | (buf[2+txLen+2]<<8) | (buf[2+txLen+3]) );
        ctx.fwt       = ((buf[2+txLen+4+0]<<24) | (buf[2+txLen+4+1]<<16) | (buf[2+txLen+4+2]<<8) | (buf[2+txLen+4+3]) );

        err = rfalStartTransceive( &ctx );

        if (*txSize) *txSize = 0;
    }

    if (cmd == RFAL_CMD_GET_TXRX_STATUS)
    {
        err = rfalGetTransceiveStatus();

        if( err != RFAL_ERR_BUSY )
        {
            RFAL_MEMCPY( (uint8_t*)&txData[2], gRxBuf, rfalConvBitsToBytes(gRcvdLen) );
        }
        txData[0] = ((gRcvdLen>>8)&0xFF);
        txData[1] = ((gRcvdLen>>0)&0xFF);

        if (*txSize) *txSize = (2 + MIN( rfalConvBitsToBytes(gRcvdLen), sizeof(gRxBuf)) );
    }
    if (cmd == RFAL_CMD_ISO14443_TXRX_SHORTFRAME)
    {
        uint32_t fwt;
        uint16_t rcvdLen;

        fwt = ((buf[1+0]<<24) | (buf[1+1]<<16) | (buf[1+2]<<8) | (buf[1+3]) );
        err = rfalISO14443ATransceiveShortFrame( (rfal14443AShortFrameCmd)buf[0], (uint8_t*)&txData[2], (*txSize - 2), &rcvdLen, fwt );

        txData[0] = ((rcvdLen>>8)&0xFF);
        txData[1] = ((rcvdLen>>0)&0xFF);

        if (*txSize) *txSize = (2 + MIN( rfalConvBitsToBytes(rcvdLen), (*txSize - 2)) );
    }
    if (cmd == RFAL_CMD_ISO14443_TXRX_ANTICOLLISION)
    {
        uint32_t fwt;
        uint16_t rcvdLen;

        *txSize = 4 + buf[0];
        fwt     = ((buf[2+0]<<24) | (buf[2+1]<<16) | (buf[2+2]<<8) | (buf[2+3]) );

        err = rfalISO14443ATransceiveAnticollisionFrame( (uint8_t*)&buf[6], (uint8_t*)&buf[0], (uint8_t*)&buf[1], &rcvdLen, fwt );

        txData[0] = buf[0];
        txData[1] = buf[1];
        txData[2] = ((rcvdLen>>8)&0xFF);
        txData[3] = ((rcvdLen>>0)&0xFF);

        *txSize += rfalConvBitsToBytes( rcvdLen );
        RFAL_MEMCPY( (uint8_t*)&txData[4], (uint8_t*)&buf[6], buf[0] + rfalConvBitsToBytes( rcvdLen ) );
    }
    if (cmd == RFAL_CMD_FELICA_POLL)
    {
        err = rfalFeliCaPoll( (rfalFeliCaPollSlots)buf[0], (uint16_t)((buf[1]<<8) | (buf[2])), buf[3], (rfalFeliCaPollRes*)&txData[2], buf[4], &txData[0], &txData[1] );

        if (*txSize) *txSize = 2 + ( txData[0] * RFAL_FELICA_POLL_RES_LEN );
    }
    if (cmd == RFAL_CMD_ISO15693_TXRX_ANTICOLLISION)
    {
        uint16_t rcvdLen;

        err = rfalISO15693TransceiveAnticollisionFrame( (uint8_t*)&buf[1], buf[0], &txData[2], (uint8_t)*txSize, &rcvdLen );

        txData[0] = ((rcvdLen>>8)&0xFF);
        txData[1] = ((rcvdLen>>0)&0xFF);

        if (*txSize) *txSize = (2 + MIN( rfalConvBitsToBytes(rcvdLen), (*txSize - 2)) );
    }
    if (cmd == RFAL_CMD_ISO15693_TXRX_ANTICOLLISION_EOF)
    {
        uint16_t rcvdLen;

        err = rfalISO15693TransceiveEOFAnticollision( &txData[2], (uint8_t)*txSize, &rcvdLen );

        txData[0] = ((rcvdLen>>8)&0xFF); 
        txData[1] = ((rcvdLen>>0)&0xFF);

        if (*txSize) *txSize = (2 + MIN( rfalConvBitsToBytes(rcvdLen), (*txSize - 2)) );
    }
    if (cmd == RFAL_CMD_ISO15693_TXRX_EOF)
    {
        uint16_t rcvdLen;

        err = rfalISO15693TransceiveEOF( &txData[2], (uint8_t)*txSize, &rcvdLen );

        txData[0] = ((rcvdLen>>8)&0xFF);
        txData[1] = ((rcvdLen>>0)&0xFF);

        if (*txSize) *txSize = (2 + MIN( rcvdLen, (*txSize - 2)) );
    }
    if (cmd == ISODEP_CMD_COMMANDS)
    {
        return(processIsoDep(rxData, rxSize, txData, txSize) );
    }

    if (cmd == RFAL_CHIP_CMD_SET_RFO){
        err = rfalChipSetRFO(rxData[1]);
    }
    if (cmd == RFAL_CHIP_CMD_GET_RFO){
        err = rfalChipGetRFO(&txData[0]);
        if (*txSize) *txSize = 1;
    }

    if (cmd == RFAL_CHIP_CMD_WAKEUP_START){
        rfalWakeUpConfig config;
        if (bufSize < 23) { *txSize = 0; return RFAL_ERR_PARAM;}
        config.period = (rfalWumPeriod)*buf++;
        config.irqTout = *buf++;
        config.swTagDetect = *buf++;
        config.indAmp.enabled = *buf++;
        config.indAmp.delta = *buf++;
        config.indAmp.fracDelta = *buf++;
        config.indAmp.reference = *buf++; // No need to set full 16 bits (internal usage)
        config.indAmp.autoAvg = *buf++;
        config.indAmp.aaInclMeas = *buf++;
        config.indAmp.aaWeight = (rfalWumAAWeight)*buf++;
        config.indPha.enabled = *buf++;
        config.indPha.delta = *buf++;
        config.indPha.fracDelta = *buf++;
        config.indPha.reference = *buf++; // No need to set full 16 bits (internal usage)
        config.indPha.autoAvg = *buf++;
        config.indPha.aaInclMeas = *buf++;
        config.indPha.aaWeight = (rfalWumAAWeight)*buf++;
        config.cap.enabled = *buf++;
        config.cap.delta = *buf++;
        config.cap.reference = *buf++; // No need to set full 16 bits (internal usage)
        config.cap.autoAvg = *buf++;
        config.cap.aaInclMeas = *buf++;
        config.cap.aaWeight = (rfalWumAAWeight)*buf++;
        err = rfalWakeUpModeStart( &config );
        *txSize = 0;
    }
    if (cmd == RFAL_CHIP_CMD_WAKEUP_HASWOKE){
        bool hasWoke = rfalWakeUpModeHasWoke( );
        txData[0] = hasWoke;
        if (*txSize) *txSize = 1;
    }
    if (cmd == RFAL_CHIP_CMD_WAKEUP_GETINFO){
        rfalWakeUpInfo info;
        if (bufSize < 1) { *txSize = 0; return RFAL_ERR_PARAM;}
        if (*txSize < 13){ *txSize = 0; return RFAL_ERR_REQUEST;}
        err = rfalWakeUpModeGetInfo( buf[0], &info );
        *txData++ = info.irqWut;
        *txData++ = info.indAmp.lastMeas;
        WRITE_VAL16_LE( info.indAmp.reference, uint16_t, txData);
        *txData++ = info.indAmp.irqWu;
        *txData++ = info.indPha.lastMeas;
        WRITE_VAL16_LE( info.indPha.reference, uint16_t, txData);
        *txData++ = info.indPha.irqWu;
        *txData++ = info.cap.lastMeas;
        WRITE_VAL16_LE( info.cap.reference, uint16_t, txData);
        *txData++ = info.cap.irqWu;
        *txSize = 13;
    }
    if (cmd == RFAL_CHIP_CMD_WAKEUP_STOP){
        err= rfalWakeUpModeStop( );
    }
    if (cmd == RFAL_CMD_DPO_GET_CURRENT_TABLE_ENTRY){
        if (* txSize < 1){ *txSize = 0; return RFAL_ERR_REQUEST;}
        * txData = rfalDpoGetCurrentTableIndex( );
        * txSize = 1;
        err      = RFAL_ERR_NONE;
    }
    if (cmd == RFAL_CMD_AC_SET){
        uint16_t ac;
        const char *              pDataIn = (const char *) buf;
        READ_VAL16_LE(ac, uint16_t           , pDataIn);
        err= rfalSetAnalogConfig(ac);
    }

