JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
    if (cmd == RFAL_CMD_DPO_READ){
        err = rfalDpoTableRead( (rfalDpoEntry*) &txData[1], rxData[1], &txData[0] );
    }
    if (cmd == RFAL_CMD_DPO_WRITE){
        uint8_t powerTableSize = rxData[1]; // Power table entries
        if(powerTableSize > 15){
            err = RFAL_ERR_PARAM;
        }else{
            err = rfalDpoTableWrite((rfalDpoEntry* )(rxData + 2), powerTableSize);
        }
    }
    if (cmd == RFAL_CMD_DPO_MEASURE_FUNC){
        switch(rxData[1]){
        default:
        case 0: rfalDpoSetMeasureCallback( rfalChipMeasureAmplitude ); break;
        case 1: rfalDpoSetMeasureCallback( rfalChipMeasurePhase ); break;
        }
        err = RFAL_ERR_NONE;
    }
    if (cmd == RFAL_CMD_DPO_ADJUST_AND_MEASURE){
      // if requested do adjust
      if(rxData[1] == 0){
          rfalDpoAdjust();
      }
      // current DPO entry
      memcpy(&txData[0], rfalDpoGetCurrentTableEntry(), sizeof(rfalDpoEntry));
      // amplitude, phase
      rfalChipMeasureAmplitude(&txData[0 + sizeof(rfalDpoEntry)]);
      rfalChipMeasurePhase(&txData[1 + sizeof(rfalDpoEntry)]);
      txData[2 + sizeof(rfalDpoEntry)] = 0;
      if (*txSize) *txSize = sizeof(rfalDpoEntry) + 3;
      err = RFAL_ERR_NONE;
    }
    
    if (cmd == RFAL_CMD_DPO_SET_ENABLED){
        rfalDpoSetEnabled(rxData[1] != 0);
        err = RFAL_ERR_NONE;
    }

    if (cmd == RFAL_CMD_DPO_IS_ENABLED){
        txData[0] = rfalDpoIsEnabled() ? 1 : 0;
        if (*txSize) *txSize = 1;
        err = RFAL_ERR_NONE;
    }

    if (cmd == RFAL_CMD_GET_TRANSCEIVE_RSSI){
        uint16_t rssi = 0;
        err = rfalGetTransceiveRSSI(&rssi);//(uint16_t*) &txData[0]);
        txData[0] = ((rssi>>8)&0xFF);
        txData[1] = ((rssi>>0)&0xFF);
        if (*txSize) *txSize = 2;
    }

    if ((cmd>>4) >= 0x8)
        err = processProtocols(rxData, rxSize, txData, txSize);

    return err;
}

uint8_t applProcessCmd( uint8_t protocol, uint16_t rxSize, const uint8_t * rxData, uint16_t * txSize, uint8_t * txData )
{ /* forward to different function to have place for doxygen documentation
     because applProcessCmd is already documented in usb_hid_stream_driver.h*/
    return processCmd( rxData, rxSize, txData, txSize);
}

void dispatcherWorker()
{
    rfalWorker();

    if (gIsoDepTransceiveOngoing == true)
    {
        gIsoDepTransceiveError = rfalIsoDepGetApduTransceiveStatus();
        if (RFAL_ERR_BUSY != gIsoDepTransceiveError)
        { /* if not busy anymore the transceive is supposed to be finished */
            gIsoDepTransceiveOngoing = false;
        }
    }
}

/*
******************************************************************************
* LOCAL FUNCTIONS
******************************************************************************
*/


/*!
  Process Topaz type commands.

  \param rxData : forward from applProcessCmd()
  \param rxSize : forward from applProcessCmd()
  \param txData : forward from applProcessCmd()
  \param txSize : forward from applProcessCmd()

  Implemented commands:

  - #topazInitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0x90(ID)</td></tr>
    </table>
    no return value only status
  - #topazDeinitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>         1</th></tr>
      <tr><th>Content</th><td>0x9f(ID)</td><td>keep_rf_on</td></tr>
    </table>
    no return value only status
  - #topazReqaWupa() + topazReadUID()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>1</th></tr>
      <tr><th>Content</th><td>0x91(ID)</td><td>0x26(REQA) or 0x52(WUPA)</td></tr>
    </table>
    *txsize must be set to allow at least 17 return values.
    <table>
      <tr><th>   Byte</th><th> 1..2</th><th>3..6</th></tr>
      <tr><th>Content</th><td>atqa </td><td> uid</td></tr>
    </table>
*/
static ReturnCode processTopaz(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize)
{
    ReturnCode err = RFAL_ERR_REQUEST;
    uint16_t bufSize = rxSize - 1;
    topazProximityCard_t card;
    const uint8_t *buf = rxData + 1;
    uint8_t cmd = rxData[0];
    RFAL_MEMSET(txData, 0xff, *txSize);

    switch (cmd)
    {
        case 0x90:
            err = topazInitialize();
            *txSize = 0;
            break;
        case 0x9f:
            {
                uint8_t keep_on = 0;
                if (bufSize > 0) keep_on = buf[0];
                err = topazDeinitialize(keep_on);
                *txSize = 0;
            }
            break;
        case 0x91:
            if (*txSize < 8) return RFAL_ERR_PARAM;
            err = topazReqaWupa((topazCommand_t)buf[0], &card);
            if (RFAL_ERR_NONE == err)
                err = topazReadUID(&card);

            txData[0] = card.atqa[0];
            txData[1] = card.atqa[1];
            txData[2] = card.hr[0];
            txData[3] = card.hr[1];
            txData[4] = card.uid[0];
            txData[5] = card.uid[1];
            txData[6] = card.uid[2];
            txData[7] = card.uid[3];

            if(*txSize > 0) *txSize = 8;
            if(RFAL_ERR_NOTSUPP == err)
                *txSize = 2;
            break;
        case 0x92:
            if (*txSize < 6) return RFAL_ERR_PARAM;
            err = topazReadUID(&card);

            txData[0] = card.hr[0];
            txData[1] = card.hr[1];
            txData[2] = card.uid[0];
            txData[3] = card.uid[1];
            txData[4] = card.uid[2];
            txData[5] = card.uid[3];

            if(*txSize > 0) *txSize = 6;
            break;
        case 0x93:
            if (bufSize < 4) { *txSize = 0; return RFAL_ERR_PARAM;}
            RFAL_MEMCPY(card.uid, buf, 4);
            err = topazReadAll(&card, txData, *txSize, txSize);
            break;
        case 0x94: /* FIXME: should be Read Byte */
            break;
        case 0x95:
            if (bufSize < 6) return RFAL_ERR_PARAM;
            RFAL_MEMCPY(card.uid, buf, 4);
            {
                uint8_t addr = buf[4], data = buf[5];
                err = topazWriteByte(&card, addr, data);
            }
            break;
        default:
            err = RFAL_ERR_PARAM;
            *txSize = 0;
    }
    return err;
}

/*!
  Process Kovio barcode type commands.

  \param rxData : forward from applProcessCmd()
  \param rxSize : forward from applProcessCmd()
  \param txData : forward from applProcessCmd()
  \param txSize : forward from applProcessCmd()

  Implemented commands:

  - #kovioInitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0x80(ID)</td></tr>
    </table>
    no return value only status
  - #kovioDeinitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>         1</th></tr>
      <tr><th>Content</th><td>0x8f(ID)</td><td>keep_rf_on</td></tr>
    </table>
    no return value only status
  - #kovioRead()
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0x81(ID)</td></tr>
    </table>
    *txsize must be set to allow at least 16 return values.
    <table>
      <tr><th>   Byte</th><th> 0..15</th></tr>
      <tr><th>Content</th><td>  uid </td></tr>
    </table>
*/
static ReturnCode processKovio(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize)
{
    ReturnCode err = RFAL_ERR_REQUEST;
    uint16_t bufSize = rxSize - 1;
    kovioProximityCard_t card;
    const uint8_t *buf = rxData + 1;
    uint8_t cmd = rxData[0];
    RFAL_MEMSET(txData, 0xff, *txSize);

