JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
    switch (cmd)
    {
        case 0x80:
            err = kovioInitialize();
            *txSize = 0;
            break;
        case 0x8f:
            {
                uint8_t keep_on = 0;
                if (bufSize > 0) keep_on = buf[0];
                err = kovioDeinitialize(keep_on);
                *txSize = 0;
            }
            break;
        case 0x81:
            if (*txSize < 32) return RFAL_ERR_PARAM;
            err = kovioRead(&card);
            if(err) *txSize = 0;
            else
            {
                RFAL_MEMCPY(txData, card.uid, card.length);
                *txSize = card.length;
            }
            break;
        default:
            err = RFAL_ERR_PARAM;
            *txSize = 0;
    }
    return err;
}


/*!
  Process ISO14443A type commands.

  \param rxData : forward from applProcessCmd()
  \param rxSize : forward from applProcessCmd()
  \param txData : forward from applProcessCmd()
  \param txSize : forward from applProcessCmd()

  Implemented commands:

  - #iso14443AInitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0xa0(ID)</td></tr>
    </table>
    no return value only status
  - #iso14443ADeinitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>         1</th></tr>
      <tr><th>Content</th><td>0xaf(ID)</td><td>keep_rf_on</td></tr>
    </table>
    no return value only status
  - #iso14443ASelect()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>1</th></tr>
      <tr><th>Content</th><td>0xa1(ID)</td><td>0x26(REQA) or 0x52(WUPA)</td></tr>
    </table>
    *txsize must be set to allow at least 17 return values.
    <table>
      <tr><th>   Byte</th><th>  0</th><th> 1..2</th><th>                 3</th><th>4..6</th><th>7..17</th></tr>
      <tr><th>Content</th><td>col</td><td>atqa</td><td>cascadelevels(1..3)</td><td>sak</td><td> uid</td></tr>
    </table>
      There are three possible values of \e cascadelevels:
      - 1: sak is one byte long, \e uid is 4 bytes long
      - 2: sak is two bytes long, \e uid is 7 bytes long
      - 3: sak is three bytes long, \e uid is 10 bytes long
  - #iso14443ASendHlta()
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0xa3(ID)</td></tr>
    </table>
    not response data available only status
  - #iso14443AEnterProtocolMode() sends ISO14443A RATS command
    <table>
      <tr><th>   Byte</th><th>       0</th><th>   1</th><th>  2</th></tr>
      <tr><th>Content</th><td>0xa4(ID)</td><td>fsdi</td><td>cid</td></tr>
    </table>
    where:
      - \e fsdi: 0-0xf Frame size for Device Index
        <table>
          <tr><th> 0</th><th> 1</th><th> 2</th><th> 3</th><th> 4</th><th> 5</th><th> 6</th><th>  7</th><th>  8</th></tr>
          <tr><td>16</td><td>24</td><td>32</td><td>40</td><td>48</td><td>64</td><td>96</td><td>128</td><td>256</td></tr>
        </table>
      - \e cid: Card Identifier to assign to the card.
      .
    *txsize must be set to allow at least 7 return values for ATS. But card response may be even longer.
    <table>
      <tr><th>   Byte</th><th> 0</th><th> 1</th><th>    2</th><th>    3</th><th>    4</th><th> 5</th><th> 6</th></tr>
      <tr><th>Content</th><td>TL</td><td>T0</td><td>TA(1)</td><td>TB(1)</td><td>TC(1)</td><td>T1</td><td>Tk</td></tr>
    </table>
  - #iso14443ASendProtocolAndParameterSelection()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>  1</th><th>        2</th><th>   3</th></tr>
      <tr><th>Content</th><td>0xa5(ID)</td><td>cid</td><td>pss0=0x11</td><td>pss1</td></tr>
    </table>
    where:
      - \e cid: the cid set using RATS command
      - \e pss0: not used internally set to 0x11, should always be set to 0x11
      - \e pss1: PSS1 according to standard, upper 4 bits shall be 0, lower 4 bits are DSI and DRI.
    no return value only status
  - #iso14443Deselect()
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0xa6(ID)</td></tr>
    </table>
    no return value only status
  - #t2tReadNBytes()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>    1</th></tr>
      <tr><th>Content</th><td>0xa7(ID)</td><td>start</td></tr>
    </table>
    This function reads starting from \e start *txSize bytes. Response is:
    <table>
      <tr><th>   Byte</th><th>0..actual_received length</th></tr>
      <tr><th>Content</th><td>received data</td></tr>
    </table>
  - #t2tWritePage()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>    1</th><th>2..6</th></tr>
      <tr><th>Content</th><td>0xa8(ID)</td><td>start</td><td>data</td></tr>
    </table>
    no return value only status
  */
static ReturnCode processIso14443a(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize)
{
    ReturnCode err;
    uint16_t bufSize = rxSize - 1;
    uint16_t actlength;
    iso14443AProximityCard_t card;
    const uint8_t *buf = rxData + 1;
    uint8_t cmd = rxData[0];
    uint8_t perform_ac = 1;
    RFAL_MEMSET(txData, 0xff, *txSize);

    switch (cmd)
    {
        case 0xa0:
            err = iso14443AInitialize();
            *txSize = 0;
            return err;

        case 0xaf:
            {
                uint8_t keep_on = 0;
                if (bufSize > 0) keep_on = buf[0];
                err = iso14443ADeinitialize(keep_on);
                *txSize = 0;
            }
            return err;

        case 0xa1:
            if (bufSize > 1) perform_ac = buf[1];
            if (*txSize < 17) return RFAL_ERR_PARAM;
            err = iso14443ASelect((iso14443ACommand_t)buf[0], &card, perform_ac);
            txData[0] = card.collision;
            txData[1] = card.atqa[0];
            txData[2] = card.atqa[1];
            RFAL_MEMSET(txData+3, 0, 14);
            if(err == RFAL_ERR_NONE){
              logUsart("ISO14443A/NFC-A card found. ATQA: %s", hex2Str(card.atqa, 2));
              if (perform_ac)
              {
                txData[3] = card.cascadeLevels;
                txData[4] = card.sak[0];
                txData[5] = card.sak[1];
                txData[6] = card.sak[2];
                RFAL_MEMCPY(txData+7, card.uid, card.actlength);
                logUsart(" SAK: %s UID: %s", hex2Str(card.sak, 3), hex2Str(card.uid, card.actlength));
              }
              logUsart("\n");
            }
            if(*txSize > 0) *txSize = 17;
            break;

        case 0xa3:
            err = iso14443ASendHlta();
            *txSize = 0;
            break;

        case 0xa4:
            if (bufSize < 2) return RFAL_ERR_PARAM;
            if (*txSize < 7) return RFAL_ERR_PARAM;
            {
                uint8_t fsdi = buf[0];
                uint8_t cid = buf[1];
                uint8_t fscid = (cid&0xf) | ((fsdi&0xf)<<4);
                err = iso14443AEnterProtocolMode(fscid, txData, *txSize, &actlength);
                *txSize = actlength;
            }
            break;

        case 0xa5:
            {
                uint8_t cid = buf[0] & 0xf;
                /* buf[1] may be used for PSS0, should be 0x11 */
                uint8_t pss1 = buf[2];
                err = iso14443ASendProtocolAndParameterSelection(cid, pss1);
            }
            *txSize = 0;
            break;

