JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
        case 0xa6:
            err = iso14443Deselect();
            *txSize = 0;
            break;

        case 0xa7:
            /* T2T read */
            {
                uint8_t actlen;
                err = t2tReadNBytes(buf[0], txData, *txSize, &actlen);
                *txSize = actlen;
            }
            break;

        case 0xa8:
            /* T2T write page */
            if (bufSize != 5)
            {
                return RFAL_ERR_PARAM;
            }
            err = t2tWritePage(buf[0], buf+1);
            *txSize = 0;
            break;

        default:
            err = RFAL_ERR_PARAM;
            *txSize = 0;
    }

    if (RFAL_ERR_NONE == err){
      ledOnOff(LED_A, VISUAL_FEEDBACK_DELAY);
    }

    return err;
}

/*!
  Process ISO14443B type commands.

  \param rxData : forward from applProcessCmd()
  \param rxSize : forward from applProcessCmd()
  \param txData : forward from applProcessCmd()
  \param txSize : forward from applProcessCmd()

  Implemented commands:

  - #iso14443BInitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0xb0(ID)</td></tr>
    </table>
    response:
    <table>
      <tr><th>   Byte</th></tr>
      <tr><th>Content</th></tr>
    </table>
  - #iso14443BDeinitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>         1</th></tr>
      <tr><th>Content</th><td>0xbf(ID)</td><td>keep_rf_on</td></tr>
    </table>
    no return value only status
  - #iso14443Deselect()
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0xb4(ID)</td></tr>
    </table>
    no return value only status
  - #iso14443BSelect() sends REQB or WUPB
    <table>
      <tr><th>   Byte</th><th>       0</th><th>  1           </th><th>  2</th><th>      3    </th></tr>
      <tr><th>Content</th><td>0xb1(ID)</td><td>wubp_else_reqb</td><td>afi</td><td>slotcnt_exp</td></tr>
    </table>
    where:
    - \e wupb_else_reqb : if true wupb is sent else reqb
    - \e afi : The AFI field as in the standard
    - \e slotcnt_exp : lower three bits determine slot count(0=1,1=2,2=4,3=8,4=16)
    response:
    <table>
      <tr><th>   Byte</th><th>   0</th><th>1..4</th><th>   5..8 </th><th>   9..11 </th><th>12 </th></tr>
      <tr><th>Content</th><td>atqb</td><td>pupi</td><td>app_data</td><td>prot_info</td><td>col</td></tr>
    </table>
    where:
    - \e col: 1=collision has happened and was resolved, 0=no collision
    .
  - #iso14443BSendHltb()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>1..4</th></tr>
      <tr><th>Content</th><td>0xb2(ID)</td><td>PUPI</td></tr>
    </table>
    no response data only status
  - #iso14443BEnterProtocolMode() sends ATTRIB
    <table>
      <tr><th>   Byte</th><th>       0</th><th>1..4</th><th> 5..8 </th></tr>
      <tr><th>Content</th><td>0xb3(ID)</td><td>pupi</td><td>params</td></tr>
    </table>
    response:
    <table>
      <tr><th>   Byte</th><th>   0    </th></tr>
      <tr><th>Content</th><td>mbli_cid</td></tr>
    </table>
    where:
    - \e mbli_cid : upper 4 bits: mbli and lower 4 bits: cid

*/
static ReturnCode processIso14443b(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize)
{
    ReturnCode err;
    uint8_t cmd = rxData[0];
    const uint8_t *buf = rxData + 1;
    const uint16_t bufSize = rxSize - 1;
    iso14443BProximityCard_t card;
    iso14443BAttribParameter_t param;
    iso14443BAttribAnswer_t answer;

    switch (cmd)
    {
        case 0xb0:
            *txSize = 0;
            err = iso14443BInitialize();
            //break;
            return err;

        case 0xbf:
            {
                uint8_t keep_on = 0;
                if (bufSize > 0) keep_on = buf[0];
                err = iso14443BDeinitialize(keep_on);
            }
            *txSize = 0;
            return err;

        case 0xb1:
            if(bufSize < 3) return RFAL_ERR_PARAM;
            if(*txSize > 13) *txSize = 13;
            err = iso14443BSelect(buf[0] ?  ISO14443B_CMD_WUPB : ISO14443B_CMD_REQB,
                    &card,
                    buf[1],
                    (iso14443BSlotCount_t)(buf[2] & 0x7));
            RFAL_MEMCPY(txData , &card, *txSize);
            if (RFAL_ERR_NONE == err)
            {
              logUsart("ISO14443B/NFC-B card found. UID: %s\n", hex2Str(card.pupi, ISO14443B_PUPI_LENGTH));
            }
            break;

        case 0xb2:
            RFAL_MEMCPY(card.pupi, &buf[0], ISO14443B_PUPI_LENGTH);
            err = iso14443BSendHltb(&card);
            *txSize = 0;
            break;

        case 0xb3:
            /* map to iso14443BEnterProtocolMode */
            RFAL_MEMCPY(card.pupi, &buf[0], ISO14443B_PUPI_LENGTH);
            RFAL_MEMCPY(&param, &buf[4], 4);
            err = iso14443BEnterProtocolMode(&card, &param, &answer);
            if (RFAL_ERR_NONE == err)
            {
                txData[0] = (answer.mbli << 4) | answer.cid;
            }
            if(*txSize > 0) *txSize = 1;
            break;

        case 0xb4:
            err = iso14443Deselect();
            *txSize = 0;
            break;

        case 0xb5:
            {
                iso14443B_ST25TB_t stcard;
                err = iso14443B_ST25TB_Initiate(&stcard);
                RFAL_MEMCPY(txData, &stcard.Chip_ID, 1);
                *txSize = 1;
            }
            break;

        case 0xb6:
            {
                iso14443B_ST25TB_t stcard;
                err = iso14443B_ST25TB_Pcall16(&stcard);
                RFAL_MEMCPY(txData, &stcard.Chip_ID, 1);
                *txSize = 1;
            }
            break;

        case 0xb7:
            {
                iso14443B_ST25TB_t stcard;
                uint8_t sn = buf[0];
                if(bufSize < 1) return RFAL_ERR_PARAM;
                err = iso14443B_ST25TB_Slot_marker(sn, &stcard);
                RFAL_MEMCPY(txData, &stcard.Chip_ID, 1);
                *txSize = 1;
            }
            break;

        case 0xb8:
            {
                iso14443B_ST25TB_t stcard;
                if(bufSize < 1) return RFAL_ERR_PARAM;
                stcard.Chip_ID = buf[0];
                err = iso14443B_ST25TB_Select(&stcard);
                *txSize = 0;
            }
            break;

        case 0xb9:
            {
                iso14443B_ST25TB_t stcard;
                if (*txSize < 8) return RFAL_ERR_PARAM;
                *txSize = 0;
                err = iso14443B_ST25TB_Get_UID(&stcard);
                if (RFAL_ERR_NONE == err)
                {
                    *txSize = 8;
                    RFAL_MEMCPY(txData, &stcard.uid, ISO14443B_ST25TB_UIDSIZE);
                    logUsart("ST25TB card found. UID: %s\n", hex2Str(stcard.uid, ISO14443B_ST25TB_UIDSIZE));
                }
            }
            break;

        case 0xba:
            {
                iso14443B_ST25TB_t stcard;
                if (*txSize < 9) return RFAL_ERR_PARAM;
                *txSize = 0;
                err = iso14443B_ST25TB_SingulateAndGetUID(&stcard);
                if (RFAL_ERR_NONE == err)
                {
                    *txSize = 9;
                    RFAL_MEMCPY(txData, &stcard.Chip_ID, 1);
                    RFAL_MEMCPY(txData+1, stcard.uid, 8);
                    logUsart("ST25TB card found. UID: %s\n", hex2Str(stcard.uid, ISO14443B_ST25TB_UIDSIZE));
                }
            }
            break;

        case 0xbb:
            {
                err = iso14443B_ST25TB_Completion();
                *txSize = 0;
            }
            break;

