JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
        case 0xbc:
            {
                err = iso14443B_ST25TB_Reset_to_inventory();
                *txSize = 0;
            }
            break;

        case 0xbd:
            {
                uint8_t address = buf[0];
                if (*txSize < 4) return RFAL_ERR_PARAM;
                *txSize = 0;
                if(bufSize < 1) return RFAL_ERR_PARAM;
                err = iso14443B_ST25TB_Read_block(address, txData);
                if (RFAL_ERR_NONE == err)
                {
                    *txSize = 4;
                }
            }
            break;

        case 0xbe:
            {
                uint8_t address = buf[0];
                if(bufSize < 5) return RFAL_ERR_PARAM;
                err = iso14443B_ST25TB_Write_block(address, rxData + 1);
                *txSize = 0;
            }
            break;

        default:
            err = RFAL_ERR_REQUEST;
            *txSize = 0;
            break;
    }

    if (RFAL_ERR_NONE == err){
      ledOnOff(LED_B, VISUAL_FEEDBACK_DELAY);
    }

    return err;
}

/*!
  Process NFC type commands.

  \param rxData : forward from applProcessCmd()
  \param rxSize : forward from applProcessCmd()
  \param txData : forward from applProcessCmd()
  \param txSize : forward from applProcessCmd()

  Implemented commands:

  - #nfcInitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>        1</th><th>        2</th><th>      3</th></tr>
      <tr><th>Content</th><td>0xc0(ID)</td><td>is_active</td><td>initiator</td><td>bitrate</td></tr>
    </table>
    no return value only status
  - #nfcDeinitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0xcf(ID)</td></tr>
    </table>
    no return value only status
  - #nfcTxNBytes()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>       1                   </th><th>2..txSize-2</th></tr>
      <tr><th>Content</th><td>0xc1(ID)</td><td>perform_collision_avoidance</td><td>       data</td></tr>
    </table>
    no return value only status
  - #nfcRxNBytes() receives at most *txSize bytes from the other NFC device
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0xc2(ID)</td></tr>
    </table>
    response:
    RFAL_ERR_NOMSG is returned as status in case there was no message.
    <table>
      <tr><th>   Byte</th><th>0..actlength</th></tr>
      <tr><th>Content</th><td>        data</td></tr>
    </table>
  - #nfcSetTxBitrate() sets the transmit bitrate
    <table>
      <tr><th>   Byte</th><th>       0</th><th>        1</th>
      <tr><th>Content</th><td>0xc4(ID)</td><td>bitrate</td>
    </table>
    no return value only status
  - #nfcSetRxBitrate() sets the receive bitrate
    <table>
      <tr><th>   Byte</th><th>       0</th><th>        1</th>
      <tr><th>Content</th><td>0xc5(ID)</td><td>bitrate</td>
    </table>
    no return value only status
*/
static ReturnCode processNfc(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize)
{
    const uint8_t *buf = rxData + 1;
    uint16_t bufSize = rxSize - 1;
    uint8_t cmd = rxData[0];
    ReturnCode err = RFAL_ERR_NONE;
    uint16_t actlength;

    switch (cmd)
    {
        case NFC_CMD_INITIALIZE:
            if (bufSize < 3) return RFAL_ERR_PARAM;
            {
                nfc_is_active = !!buf[0];
                nfc_is_initiator = !!buf[1];
                nfc_bitrate = buf[2]; /* speed is 2^bitrate * 106 kb/s */
                nfc_lmMask = buf[3];
                err = nfcInitialize(nfc_is_active, nfc_is_initiator, nfc_bitrate, nfc_lmMask);
            }
            return err;

        case NFC_CMD_DEINITIALIZE:
            err = nfcDeinitialize();
            return err;

        case NFC_CMD_TX_NBYTES:
            if (bufSize < 1) return RFAL_ERR_PARAM;
            {
                err = nfcTxNBytes(buf, bufSize);
            }
            break;

        case NFC_CMD_RX_NBYTES:
            err = nfcRxNBytes(txData, &txData[1], *txSize - 1, &actlength);
            *txSize = actlength + 1;
            break;

        case NFC_CMD_RFU1:
        case NFC_CMD_RFU2:
            return RFAL_ERR_REQUEST;

        case NFC_CMD_SET_TXBITRATE:
            err = nfcSetTxBitrate(buf[0]);
            break;

        case NFC_CMD_SET_RXBITRATE:
            err = nfcSetRxBitrate(buf[0]);
            break;

        case NFC_CMD_NFCDEP_TX:
            err = nfcDepTx( buf, bufSize );
            break;

        case NFC_CMD_NFCDEP_RX:
            err = nfcDepRx( &txData[0], (*txSize), &actlength );
            *txSize = actlength;
            break;

        case NFC_CMD_NFCDEP_INIT_HANDLEACTIVATION:
            if( *txSize < (2 + RFAL_NFCDEP_ATRRES_MAX_LEN) )  /* Response: current bit rate, ATR_RES length, ATR_RES */
            {
                return RFAL_ERR_PARAM;
            }
            err = nfcDepInitiatorHandleActivation( (uint8_t*)&buf[0], buf[10], buf[11], (uint8_t*)&buf[12], &txData[0], &txData[1], &txData[2] );
            break;

        case NFC_CMD_NFCDEP_DESELECT:
            err = nfcDepDeselect( );
            break;

        case NFC_CMD_NFCDEP_TARG_SETPARAMS:
            nfcDepTargetSetParams( (uint8_t*)&buf[0], buf[10], buf[11], (uint8_t*)&buf[12] );
            err = RFAL_ERR_NONE;
            break;

        case NFC_CMD_NFCDEP_ATR:
            if( *txSize < (1 + RFAL_NFCDEP_ATRRES_MAX_LEN) )  /* Response: ATR_RES length, ATR_RES */
            {
                return RFAL_ERR_PARAM;
            }
            err = nfcDepATR( (uint8_t*)&buf[0], buf[10], (uint8_t*)&buf[11], &txData[0], &txData[1] );
            break;

        case NFC_CMD_NFCDEP_PSL:
            err = nfcDepPSL( buf[0], buf[1], buf[2] );
            break;

        case NFC_CMD_NFCDEP_TARG_HANDLEACTIVATION:
            if( *txSize < (2 + RFAL_NFCDEP_ATRRES_MAX_LEN) )  /* Response: bitrate, ATR_REQ length, ATR_REQ */
            {
                return RFAL_ERR_PARAM;
            }
            err = NfcDepTargetHandleActivation( &txData[0], (bool*)&txData[1], &txData[2], &txData[3] );
            break;

        default:
            err = RFAL_ERR_REQUEST;
    }

    if (RFAL_ERR_NONE == err){
      ledOnOff(LED_AP2P, VISUAL_FEEDBACK_DELAY);
    }

