JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
    return err;
}

/*!
  Process ISO15693 type commands.

  \param rxData : forward from applProcessCmd()
  \param rxSize : forward from applProcessCmd()
  \param txData : forward from applProcessCmd()
  \param txSize : forward from applProcessCmd()

  Implemented commands:

  - #iso15693Initialize()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>           1</th></tr>
      <tr><th>Content</th><td>0xd0(ID)</td><td>use_1_of_256</td></tr>
    </table>
    no return value only status
  - #iso15693Deinitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>         1</th></tr>
      <tr><th>Content</th><td>0xdf(ID)</td><td>keep_rf_on</td></tr>
    </table>
    no return value only status
  - #iso15693Inventory()
    <table>
      <tr><th>   Byte</th><th>       0        </th></tr>
      <tr><th>Content</th><td>0xd2 or 0xd3(ID)</td></tr>
    </table>
    Command \e 0xd2 uses 1 slot, \e 0xd3 uses 16 slots inventory round.
    txSize has to be set to accomodate enough cards.
    Response is:
    <table>
      <tr><th>   Byte</th><th>   0     </th><th>                1..10 </th><th>..</th><th>1+(num_cards*10)..10*(num_cards+1)</th></tr>
      <tr><th>Content</th><td>num_cards</td><td>flags_0,dsfid_0,uid_0</td><td>..</td><td>flags,dsfid,uid_num_cards</td></tr>
    </table>
  - #iso15693SendStayQuiet()
    <table>
      <tr><th>   Byte</th><th>   0    </th><th>  1  </th><th>2..9</th></tr>
      <tr><th>Content</th><td>0xd4(ID)</td><td>flags</td><td> UID</td></tr>
    </table>
    If SELECT flag(0x10) is set in \e flags, then UID can be omitted, operations works on selected flag.
    no response data only status
  - #iso15693SelectPicc()
    <table>
      <tr><th>   Byte</th><th>   0    </th><th>  1  </th><th>2..9</th></tr>
      <tr><th>Content</th><td>0xd5(ID)</td><td>flags</td><td> UID</td></tr>
    </table>
    If SELECT flag(0x10) is set in \e flags, then UID can be omitted, operations works on selected flag.
    no response data only status

  - #iso15693GetPiccSystemInformation()
    <table>
      <tr><th>   Byte</th><th>   0    </th><th>  1  </th><th>2..9</th></tr>
      <tr><th>Content</th><td>0xd6(ID)</td><td>flags</td><td> UID</td></tr>
    </table>
    If SELECT flag(0x10) is set in \e flags, then UID can be omitted, operations works on selected flag.
    response is:
    <table>
      <tr><th>   Byte</th><th> 0   </th><th>        1</th><th>2..9</th><th>10   </th><th>11 </th><th>12 </th><th>13 </th><th>14 </th></tr>
      <tr><th>Content</th><td>flags</td><td>infoFlags</td><td>uid </td><td>dsfid</td><td>afi</td><td>memNumBlocks</td><td>memBlockSize</td><td>icReference</td></tr>
    </table>
  - #iso15693ReadSingleBlock()
    <table>
      <tr><th>   Byte</th><th>   0    </th><th>  1  </th><th>2..9</th><th>10</th></tr>
      <tr><th>Content</th><td>0xd7(ID)</td><td>flags</td><td> UID</td><td>block_no</td></tr>
    </table>
    If SELECT flag(0x10) is set in \e flags, then UID can be omitted, operations works on selected flag.
    Response is:
    <table>
      <tr><th>   Byte</th><th>   0     </th><th>1..memBlock.actualSize+1</th></tr>
      <tr><th>Content</th><td>rec_flags</td><td>read_data               </td></tr>
    </table>
  - #iso15693WriteSingleBlock()
    <table>
      <tr><th>   Byte</th><th>   0    </th><th>  1  </th><th>2..9</th><th>   10   </th><th>11..11+blocksize</th></tr>
      <tr><th>Content</th><td>0xd8(ID)</td><td>flags</td><td> UID</td><td>block_no</td><td>   data         </td></tr>
    </table>
    If SELECT flag(0x10) is set in \e flags, then UID can be omitted, operations works on selected flag.
    No response data only status is returned.

  - #iso15693TxRxNBytes() generic sending of a byte stream, receives at most txSize
    <table>
      <tr><th>   Byte</th><th>   0    </th><th>1..rxSize</th></tr>
      <tr><th>Content</th><td>0xde(ID)</td><td>tx_buf   </td></tr>
    </table>
    Response is:
    <table>
      <tr><th>   Byte</th><th>0..txSize</th></tr>
      <tr><th>Content</th><td>read_data</td></tr>
    </table>
*/

static iso15693ProximityCard_t cards[1];
static rfalNfcvListenDevice vCards[24];
static ReturnCode processIso15693(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize)
{
    const uint8_t *buf     = rxData + 1;
    const uint16_t bufSize = rxSize - 1;
    uint8_t        cmd     = rxData[0];
    ReturnCode     err     = RFAL_ERR_NONE;
    uint8_t        buffTmp[0x20];
    const uint8_t *uid     = NULL;
    iso15693ProximityCard_t *       cardptr;
    iso15693PiccSystemInformation_t sysInfo;
    iso15693PiccMemoryBlock_t       memBlock;
    uint8_t  actcnt;
    uint8_t  resFlags;
    uint16_t actLen;

    cardptr = NULL;
    if (cmd>=0xd4 && cmd<0xdf)
    {
        if (bufSize == 0) return RFAL_ERR_PARAM;
        if (bufSize >= 1+ISO15693_UID_LENGTH && !(buf[0]&0x10))
        {
            RFAL_MEMCPY(cards[0].uid, buf + 1, ISO15693_UID_LENGTH);
            cardptr = cards + 0;
            uid     = buf + 1; // Keep address of uid
        }
    }
    switch (cmd)
    {
        case 0xd0:
            iso15693Initialize( buf[0]?true:false, buf[1]?true:false );
            return err;

        case 0xdf:
            {
                uint8_t keep_on = 0;
                if (bufSize > 0) keep_on = buf[0];
                err = iso15693Deinitialize(keep_on);
            }
            return err;

        case 0xd2:
        case 0xd3:
            {
                if (0xd2 == cmd)
                { /* NFC compliance mode does a 1 slot inventory in the beginning */
                    err = rfalNfcvPollerCollisionResolution(RFAL_COMPLIANCE_MODE_NFC, 24, vCards, &actcnt);
                }
                else
                { /* ISO compliance mode does immediately send 16 slot inventory */
                    err = rfalNfcvPollerCollisionResolution(RFAL_COMPLIANCE_MODE_ISO, 24, vCards, &actcnt);
                    // Enabling "WithSleep" would change state of the cards - unexpected for the user
                    // and only rarely finds more cards.
                    //err = rfalNfcvPollerCollisionResolutionWithSleep(24, vCards, &actcnt);
                }
                if (actcnt > 0)
                {
                    uint8_t i, *tx = txData;
                    *tx = actcnt;
                    tx++;

                    logUsart("ISO15693/NFC-V card(s) found. Cnt: %d UID: ", actcnt);

                    for (i = 0; i < actcnt; i++)
                    {
                        if (*txSize < (i+1) * RFAL_NFCV_UID_LEN + 1) 
                        {
                            i++;
                            break;
                        }
                        /* flags, dsfid, uid */
                        RFAL_MEMCPY(tx, &vCards[i].InvRes, RFAL_NFCV_UID_LEN + 2);
                        tx += RFAL_NFCV_UID_LEN + 2;

