JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
                        logUsart("%s, ", hex2Str(vCards[i].InvRes.UID, RFAL_NFCV_UID_LEN));
                    }
                    logUsart("\n");
                    *txSize = 1 + i * (RFAL_NFCV_UID_LEN + 2);
                    err = RFAL_ERR_NONE;
                }
                else
                {
                    *txData = 0;
                    *txSize = 1;
                }
                break;
            }
        case 0xd4:
            if (bufSize < 9) return RFAL_ERR_PARAM;
            err = iso15693SendStayQuiet(cardptr);
            break;

        case 0xd5:
            if (bufSize < 9) return RFAL_ERR_PARAM;
            err = iso15693SelectPicc(cardptr);
            break;

        case 0xd6:
            if ( (bufSize < (1 + ISO15693_UID_LENGTH)) || (bufSize > (2 + ISO15693_UID_LENGTH)))
                return RFAL_ERR_PARAM;
            else
            {
                int mode = 0;
                if (bufSize == (1 + ISO15693_UID_LENGTH) ) 
                { // Regular case GetSystemInfo
                    err = iso15693GetPiccSystemInformation(cardptr, &sysInfo, &actLen);
                    if (RFAL_ERR_NONE == err)
                    {
                        if (*txSize > sizeof(sysInfo))
                            *txSize = sizeof(sysInfo);
                        RFAL_MEMCPY(txData, &sysInfo, *txSize);
                    }
                    else
                    {
                      *txSize = 0;
                    }
                }
                else
                {
                    mode = buf[ 1 + ISO15693_UID_LENGTH];
                }
                switch( mode)
                {
                    case 0: // Regular case GetSystemInfo
                        err = rfalNfcvPollerGetSystemInformation( RFAL_NFCV_REQ_FLAG_DEFAULT, uid, (uint8_t *) buffTmp, sizeof (buffTmp), &actLen);
                        if (RFAL_ERR_NONE == err)
                        {
                            if (*txSize > sizeof(sysInfo))
                                *txSize = sizeof(sysInfo);
                            RFAL_MEMCPY(txData, buffTmp, *txSize);
                        }
                        break;
                    case 1 : // Vicinity mode
                        err = rfalNfcvPollerGetSystemInformation( RFAL_NFCV_REQ_FLAG_DEFAULT | RFAL_NFCV_REQ_FLAG_PROTOCOL_EXT, uid, (uint8_t *) buffTmp, sizeof (buffTmp), &actLen);

                        if (RFAL_ERR_NONE == err)
                        {
                            if (*txSize > actLen)
                                *txSize = actLen;
                            RFAL_MEMCPY(txData, buffTmp, *txSize);
                        }
                        break;
                    case 2 :
                        err = iso15693GetPiccSystemInformation(cardptr , &sysInfo, &actLen);
                        if (RFAL_ERR_NONE == err)
                        {
                            if (*txSize > sizeof(sysInfo))
                                *txSize = sizeof(sysInfo);
                            RFAL_MEMCPY(txData, &sysInfo, *txSize);
                        }
                        break;                    default:
                        return RFAL_ERR_PARAM;
                }
            }
            if (RFAL_ERR_NONE != err)
            {
              * txSize = 0;
            }
            break;
        case 0xd7:
            if (bufSize < ISO15693_UID_LENGTH + 2) return RFAL_ERR_PARAM;
            if (*txSize < 2) return RFAL_ERR_PARAM;
            memBlock.blocknr = buf[9];
            err = iso15693ReadSingleBlock(cardptr, &memBlock);
            if (RFAL_ERR_NONE == err)
            {
                txData[0] = memBlock.flags;
                if (memBlock.errorCode == 0)
                {
                    if (*txSize > memBlock.actualSize + 1)
                        *txSize = memBlock.actualSize + 1;
                    RFAL_MEMCPY(txData+1,memBlock.data,*txSize - 1);
                }
                else
                {
                    txData[1] = memBlock.errorCode;
                    *txSize = 2;
                }
            }
            else
            {
                *txSize = 0;
            }
            break;

        case 0xd8:
            if (bufSize < ISO15693_UID_LENGTH + 3) return RFAL_ERR_PARAM;
            memBlock.actualSize = bufSize - ISO15693_UID_LENGTH - 2;
            memBlock.blocknr = buf[9];
            RFAL_MEMCPY((uint8_t*)memBlock.data, buf + 10, memBlock.actualSize);
            err = iso15693WriteSingleBlock(cardptr, buf[0], &memBlock);
            break;

        case 0xd9:  /* Fast Read Single Block */
            if (bufSize < ISO15693_UID_LENGTH + 2) return RFAL_ERR_PARAM;
            if (*txSize < 2) return RFAL_ERR_PARAM;

            memBlock.blocknr = buf[9];
            err = iso15693FastReadSingleBlock(cardptr, &memBlock);
            if (RFAL_ERR_NONE == err)
            {
                txData[0] = memBlock.flags;
                if (memBlock.errorCode == 0)
                {
                    if (*txSize > memBlock.actualSize + 1)
                        *txSize = memBlock.actualSize + 1;
                    RFAL_MEMCPY(txData+1,memBlock.data,*txSize - 1);
                }
                else
                {
                    txData[1] = memBlock.errorCode;
                    *txSize = 2;
                }
            }
            else
            {
              *txSize = 0;
            }
            break;

         case 0xda:   /* Fast Read Multiple Blocks */
            if (bufSize < ISO15693_UID_LENGTH + 3) return RFAL_ERR_PARAM;
            if (*txSize < 2) return RFAL_ERR_PARAM;

            err = iso15693FastReadMultipleBlocks(cardptr, buf[9], buf[10], &resFlags, &txData[1], *txSize, &actLen  );
            if (RFAL_ERR_NONE == err)
            {
                txData[0] = resFlags;
                if (err == 0)
                {
                    *txSize = (actLen + 1); /* Flags + Data */
                }
                else
                {
                    txData[1] = err;
                    *txSize = 2;
                }
            }
            else
            {
              *txSize = 0;
            }
            break;

        case 0xdb:    /* Read Multiple Blocks */
            if (bufSize < ISO15693_UID_LENGTH + 3) return RFAL_ERR_PARAM;
            if (*txSize < 2) return RFAL_ERR_PARAM;

