JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
            err = iso15693ReadMultipleBlocks(cardptr, buf[9], buf[10], &resFlags, &txData[1], *txSize, &actLen  );
            if (RFAL_ERR_NONE == err)
            {
                txData[0] = resFlags;
                if (err == 0)
                {
                    *txSize = (actLen + 1);  /* Flags + Data */
                }
                else
                {
                    txData[1] = err;
                    *txSize = 2;
                }
            }
            else
            {
              *txSize = 0;
            }
            break;

        case 0xdd:
            {
                uint16_t actlength = 0;
                uint16_t response_wait_time_ms = buf[0] | (buf[1] << 8);

                if (bufSize < 2) return RFAL_ERR_PARAM;

                /* Generic command iso15693_2 command, i.e. no flag and crc handling */
                /* Relax settings of mask receive timer for protocols which answer earlier */
                rfalSetFDTListen( 1 ); /* a low value, RFAL will adapt it to the allowed minimum */
                err = rfalTransceiveBlockingTxRx( (uint8_t*)(buf + 2), (bufSize - 2), txData, *txSize, &actlength,
                                            (RFAL_TXRX_FLAGS_CRC_TX_MANUAL | RFAL_TXRX_FLAGS_CRC_RX_KEEP | RFAL_TXRX_FLAGS_NFCIP1_OFF | RFAL_TXRX_FLAGS_AGC_ON | RFAL_TXRX_FLAGS_PAR_RX_REMV | RFAL_TXRX_FLAGS_NFCV_FLAG_MANUAL),
                                             rfalConvMsTo1fc(response_wait_time_ms)  );
                *txSize = actlength;
            }
            break;

        case 0xde:
            {
                uint16_t actlength = 0;
                if (bufSize < 2) return RFAL_ERR_PARAM;
                uint16_t response_wait_time_ms = buf[0] | (buf[1] << 8);
                /* Generic command */
                err = iso15693TxRxNBytes((uint8_t*)buf + 2, bufSize - 2, txData, *txSize, &actlength, response_wait_time_ms);
                *txSize = actlength;
            }
            break;

        default:
            err = RFAL_ERR_REQUEST;
    }

    if (RFAL_ERR_NONE == err){
      ledOnOff(LED_V, VISUAL_FEEDBACK_DELAY);
    }

    return err;
}

/*!
  Process direct commmands. Some direct commands produce a value which can be read back.

  \param rxData : forward from applProcessCmd()
  \param rxSize : forward from applProcessCmd()
  \param txData : forward from applProcessCmd()
  \param txSize : forward from applProcessCmd()

  All ST25R3911 direct commands between 0xC0 and 0xFF are executed.
  The Host->Device packets all have the same layout:

  <table>
    <tr><th>   Byte</th><th>       0</th><th>       1             </th></tr>
    <tr><th>Content</th><td>0x15(ID)</td><td>ST25R3911 direct command</td></tr>
  </table>

  Some direct commands have special handling, i.e. they return values:

  - #ST25R3911_CMD_MEASURE_AMPLITUDE 0xD3:
    Function st25r3911MeasureRF() is called which returns  the measured amplitude read from register ST25R3911_REG_AD_RESULT.
    Response is:
    <table>
      <tr><th>   Byte</th><th>         0          </th></tr>
      <tr><th>Content</th><td>ST25R3911_REG_AD_RESULT</td></tr>
    </table>
  - #ST25R3911_CMD_ADJUST_REGULATORS 0xD6:
    Clear reg_s bit and call st25r3911AdjustRegulators(). The register
    ST25R3911_REG_REGULATOR_RESULT is read and converted to uint16_t milliVolts.
    Response is:
    <table>
      <tr><th>   Byte</th><th>         0    </th><th>         0    </th></tr>
      <tr><th>Content</th><td>LSB millivolts</td><td>MSB millivolts</td></tr>
    </table>
  - #ST25R3911_CMD_CALIBRATE_MODULATION 0xD7:
    Function st25r3911CalibrateModulationDepth() is called which returns register ST25R3911_REG_AM_MOD_DEPTH_RESULT.
    Response is:
    <table>
      <tr><th>   Byte</th><th>                   0          </th></tr>
      <tr><th>Content</th><td>ST25R3911_REG_AM_MOD_DEPTH_RESULT</td></tr>
    </table>
  - #ST25R3911_CMD_CALIBRATE_ANTENNA 0xD8:
    First the bit trim_s gets cleared to make command do something.
    Function st25r3911CalibrateAntenna() gets called which returns register ST25R3911_REG_ANT_CAL_RESULT.
    Response is:
    <table>
      <tr><th>   Byte</th><th>                   0     </th></tr>
      <tr><th>Content</th><td>ST25R3911_REG_ANT_CAL_RESULT</td></tr>
    </table>
  - #ST25R3911_CMD_MEASURE_PHASE 0xD9:
    Function st25r3911MeasureAntennaResonance() is called which returns the register ST25R3911_REG_AD_RESULT.
    Response is:
    <table>
      <tr><th>   Byte</th><th>         0          </th></tr>
      <tr><th>Content</th><td>ST25R3911_REG_AD_RESULT</td></tr>
    </table>
  - #ST25R3911_CMD_CALIBRATE_C_SENSOR 0xDD:
    Response is:
    <table>
      <tr><th>   Byte</th><th>         0          </th></tr>
      <tr><th>Content</th><td>ST25R3911_REG_CAP_SENSOR_RESULT</td></tr>
    </table>
  - #ST25R3911_CMD_MEASURE_CAPACITANCE 0xDE:
    Response is:
    <table>
      <tr><th>   Byte</th><th>         0          </th></tr>
      <tr><th>Content</th><td>ST25R3911_REG_AD_RESULT</td></tr>
    </table>
  - #ST25R3911_CMD_MEASURE_VDD 0xDF :
    This command is special as it takes as additional parameter mpsv the id
    of the power supply which should be measured. If set the value is written
    into register ST25R3911_REG_REGULATOR_CONTROL_mpsv_vdd:
    <table>
      <tr><th>  0</th><th>    1</th><th>  2  </th><th>   3  </th></tr>
      <tr><th>VDD</th><td>VSP_A</td><td>VSP_D</td><td>VSP_RF</td></tr>
    </table>
    So the packet sent to the host looks like this:
    <table>
      <tr><th>   Byte</th><th>       0</th><th> 1  </th><th> 2  </th></tr>
      <tr><th>Content</th><td>0x15(ID)</td><td>0xDF</td><td>mpsv</td></tr>
    </table>
    Function st25r3911MeasureVoltage() returns the measured voltage as uint16_t milliVolts:
    <table>
      <tr><th>   Byte</th><th>         0    </th><th>         0    </th></tr>
      <tr><th>Content</th><td>LSB millivolts</td><td>MSB millivolts</td></tr>
    </table>
*/
static ReturnCode processDirectCommand(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize)
{
    uint8_t cmd = rxData[0];
    RFAL_MEMSET(txData, 0xff, *txSize);
    ReturnCode err = RFAL_ERR_NONE;

    /* direct commands */
    switch (cmd)
    {
        case ST25R3916_CMD_MEASURE_AMPLITUDE:
            err = st25r3916MeasureAmplitude(txData);
            if (*txSize) *txSize = 1;
            break;
        case ST25R3916_CMD_ADJUST_REGULATORS:
            { /* make sure MSB of voltage definition register is cleared */
                uint16_t mV;
                err = st25r3916ModifyRegister(ST25R3916_REG_REGULATOR_CONTROL, ST25R3916_REG_REGULATOR_CONTROL_reg_s, 0x0);
                st25r3916AdjustRegulators(&mV);
                txData[0] = mV & 0xff;
                txData[1] = mV >> 8;
                if (*txSize) *txSize = 2;
            }
            break;
        case ST25R3916_CMD_MEASURE_PHASE:
            err = st25r3916MeasurePhase(txData );
            if (*txSize) *txSize = 1;
            break;
#ifdef ST25R3916
        case ST25R3916_CMD_MEASURE_CAPACITANCE:                    // !!!! add methods
            err = st25r3916ExecuteCommandAndGetResult(cmd,
                                        ST25R3916_REG_AD_RESULT,
                                        100,
                                        txData);
            if (*txSize) *txSize = 1;
            break;
        case ST25R3916_CMD_CALIBRATE_C_SENSOR:
            err = st25r3916ExecuteCommandAndGetResult(cmd,
                                        ST25R3916_REG_CAP_SENSOR_RESULT,
                                        255,
                                        txData);
            if (*txSize) *txSize = 1;
            break;
#endif
        case ST25R3916_CMD_MEASURE_VDD:
            {
                uint16_t val = 0;
                uint8_t mpsv = 0;
                if (rxSize > 1){
                    mpsv = rxData[1];
                }else
                {
                    err = st25r3916ReadRegister(ST25R3916_REG_REGULATOR_CONTROL, &mpsv);
                    mpsv &= ST25R3916_REG_REGULATOR_CONTROL_mpsv_mask;
                }

