JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
                if(mpsv == 0xFF){
                  // measure all
                  uint8_t i = 0;
                  val = st25r3916MeasureVoltage(ST25R3916_REG_REGULATOR_CONTROL_mpsv_vdd);    txData[i++] = val & 0xff; txData[i++] = val >> 8;
                  val = st25r3916MeasureVoltage(ST25R3916_REG_REGULATOR_CONTROL_mpsv_vdd_rf); txData[i++] = val & 0xff; txData[i++] = val >> 8;
                  val = st25r3916MeasureVoltage(ST25R3916_REG_REGULATOR_CONTROL_mpsv_vdd_a);  txData[i++] = val & 0xff; txData[i++] = val >> 8;
                  val = st25r3916MeasureVoltage(ST25R3916_REG_REGULATOR_CONTROL_mpsv_vdd_d);  txData[i++] = val & 0xff; txData[i++] = val >> 8;
                  val = st25r3916MeasureVoltage(ST25R3916_REG_REGULATOR_CONTROL_mpsv_vdd_am); txData[i++] = val & 0xff; txData[i++] = val >> 8;
                  txData[i++] = 0;  txData[i++] = 0;
                  if (*txSize) *txSize = i;
                  
                }else{
                
                  // measure requested value
                  switch(mpsv){
                    case ST25R3916_REG_REGULATOR_CONTROL_mpsv_vdd:
                    case ST25R3916_REG_REGULATOR_CONTROL_mpsv_vdd_rf:
                    case ST25R3916_REG_REGULATOR_CONTROL_mpsv_vdd_a:
                    case ST25R3916_REG_REGULATOR_CONTROL_mpsv_vdd_d:
                    case ST25R3916_REG_REGULATOR_CONTROL_mpsv_vdd_am:
                      val = st25r3916MeasureVoltage(mpsv);
                      break;
                      
                   default:
                    *txSize = 0;
                    break;
                  }

                  txData[0] = val & 0xff;
                  txData[1] = val >> 8;
                  if (*txSize) *txSize = 2;
              }
            }
            break;

        default:
            err = st25r3916ExecuteCommand(cmd);
            *txSize = 0;
    }

    return err;
}

/*!
  Process FeliCa type commands.

  \param rxData : forward from applProcessCmd()
  \param rxSize : forward from applProcessCmd()
  \param txData : forward from applProcessCmd()
  \param txSize : forward from applProcessCmd()

  Implemented commands:

  - #felicaInitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th></tr>
      <tr><th>Content</th><td>0xf0(ID)</td></tr>
    </table>
    no response except status.
  - #felicaDeinitialize()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>         1</th></tr>
      <tr><th>Content</th><td>0xff(ID)</td><td>keep_rf_on</td></tr>
    </table>
    no return value only status
  - #felicaPoll()
    <table>
      <tr><th>   Byte</th><th>       0</th><th>       1 </th><th>   2</th><th>   3</th><th>     1</th></tr>
      <tr><th>Content</th><td>0xf1(ID)</td><td>num_slots</td><td>sys1</td><td>sys2</td><td>compar</td></tr>
    </table>
    where
    <ul>
      <li> \e num_slots : (0,1,3,7,15) the number of slots(1,2,4,8,16) to be performed
      <li> \e sys1: paramter accoring standard for POLL command.
      <li> \e sys2: paramter accoring standard for POLL command.
      <li> \e compar: paramter accoring standard for POLL command:
          <ul>
              <li> 0: no additional info requested
              <li> 1: request system code
              <li> 2: request communication information
              <li> others: reserved
           </ul>
    </ul>
    Response is:
    <table>
      <tr><th>   Byte</th><th>   0     </th><th>   1    </th><th> 2    </th><th>..</th><th> 22   </th><th>..</th><th> 42   </th><th>..</th></tr>
      <tr><th>Content</th><td>num_cards</td><td>num_cols</td><td>card 0</td><td>..</td><td>card 1</td><td>..</td><td>card 2</td><td>..</td></tr>
    </table>
    <ul>
      <li> \e num_cards : the number of cards following
      <li> \e num_cols: the number of collisions detected in responses to POLL command
      <li> \e card: felica Proximity card response according to layout of struct #felicaProximityCard.
    </ul>
    */
static ReturnCode processFeliCa(const uint8_t *rxData, uint16_t rxSize, uint8_t *txData, uint16_t *txSize)
{
    uint8_t cmd = rxData[0];
    ReturnCode err = RFAL_ERR_NONE;
    const uint8_t *buf = rxData + 1;
    uint16_t bufSize = rxSize - 1;
    uint16_t numBytesReceived;

    RFAL_MEMSET(txData, 0xff, *txSize);

    switch (cmd)
    {
        case 0xF0:
            /* Configure demoboard for FeliCa. */
            err = felicaInitialize();
            *txSize = 0;
            return err;

        case 0xF1:
            {
            uint8_t i;
            uint8_t slots = buf[0];
            uint8_t sys1 = buf[1];
            uint8_t sys2 = buf[2];
            uint8_t compar = buf[3];
            uint8_t *num_cards, *num_cols;
            if (bufSize < 4) return RFAL_ERR_PARAM;
            if (*txSize < 2) return RFAL_ERR_PARAM;
            num_cards = txData;
            num_cols = txData + 1;
            *num_cards = (*txSize - 2) / sizeof(struct felicaProximityCard);
            *num_cols = 0;

            err = felicaPoll( (enum felicaSlots) slots, sys1, sys2, (enum felicaComParamRequest) compar,
                    (struct felicaProximityCard*) (txData + 2),
                    num_cards, num_cols);

            if ((*num_cards > 0)&&(RFAL_ERR_NONE == err)){
              ledOnOff(LED_F, VISUAL_FEEDBACK_DELAY);
              logUsart("Felica/NFC-F card(s) found. Cnt: %d UID: ", *num_cards);
              for(i = 0; i < *num_cards; i++)
              {
                logUsart("%s, ", hex2Str(((struct felicaProximityCard*) (txData + 2 + (i*sizeof(struct felicaProximityCard))))->IDm, FELICA_MAX_ID_LENGTH));
              }
              logUsart("\n");
            }

            break;
            }

        case 0xF2:
            err =  felicaTxRxNBytes(buf, bufSize, txData, *txSize, &numBytesReceived);
            *txSize = numBytesReceived;

            if (RFAL_ERR_NONE == err){
              ledOnOff(LED_F, VISUAL_FEEDBACK_DELAY);
            }
            break;

        case 0xFF:
            if (bufSize < 1) return RFAL_ERR_PARAM;
            *txSize = 0;
            felicaDeinitialize(buf[0]);
            return err;

        default:
            err = RFAL_ERR_REQUEST;
    }
    return err;
}

/*!
  Process card emulation commmands.

  \param rxData : forward from applProcessCmd()
  \param rxSize : forward from applProcessCmd()
  \param txData : forward from applProcessCmd()
  \param txSize : forward from applProcessCmd()

*/
static ReturnCode processCardEmulation(const uint8_t * rxData, const uint16_t rxSize, uint8_t * txData, uint16_t *txSize)
{
    uint8_t ceCmd = rxData[1];
    ReturnCode err = RFAL_ERR_NONE;

    memset(txData, 0x0, *txSize);

    /* cardEmulation commands */
    switch (ceCmd)
    {
        case CARDEMULATION_CMD_START:
            txData[0] = ceStart(&rxData[2], rxSize - 2);
            *txSize = 1;
            break;

        case CARDEMULATION_CMD_STOP:
            txData[0] = ceStop();
            *txSize = 1;
            break;

