JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
        case CARDEMULATION_CMD_GET_RX_A:
        case CARDEMULATION_CMD_GET_RX_B:
        case CARDEMULATION_CMD_GET_RX_F:
            //
            *txSize = 0;
            err = txData[0] = ceGetRx(ceCmd, &txData[1], txSize);
            (*txSize)++;
            break;

        case CARDEMULATION_CMD_SET_TX_A:
        case CARDEMULATION_CMD_SET_TX_B:
        case CARDEMULATION_CMD_SET_TX_F:
            //
            err= txData[0] = ceSetTx(ceCmd, &rxData[2], rxSize - 2);
            *txSize = 1;
            break;

        case CARDEMULATION_CMD_GET_LISTEN_STATE:
            //
            *txSize = 0;
            txData[0] = ceGetListenState(&txData[1], txSize);
            (*txSize)++;
            break;

        default:
            err = RFAL_ERR_PARAM;
            break;
    }

    return err;
}

ReturnCode processDefault(const uint8_t *rxData, const uint16_t rxSize, uint8_t *txData, uint16_t *txSize)
{
    uint8_t    ceCmd = rxData[0];
    ReturnCode err   = RFAL_ERR_NONE;
    if (txSize)
    {
        * txSize =  0;
    }
    switch (ceCmd)
    {
        case CMD_APPL_COM_WUPA:  /*!< = 0xE3  WUPB button pressed. */
            if (! rfalIsExtFieldOn() & 0)
            {
                err = RFAL_ERR_PROTO;
            }
            else
            {    /* Initialize for Type A */
                 rfalNfcaSensRes sensRes;
                 rfalNfcaPollerInitialize();
                 rfalSetErrorHandling(RFAL_ERRORHANDLING_NONE);
                 rfalFieldOnAndStartGT();    /* Field On and Start Tp */
                 rfalNfcaPollerCheckPresence(RFAL_14443A_SHORTFRAME_CMD_WUPA, & sensRes);
            }
             break;
        case CMD_APPL_COM_WUPB:  /*!< = 0xE4  WUPB button pressed. */
           if (!rfalIsExtFieldOn() & 0)
            {
                err = RFAL_ERR_PROTO;
            }
            else
            {                /* Initialize for Type B */
                rfalNfcbSensbRes  sensRes;
                uint8_t           sensResLen = 0;
                rfalNfcbPollerInitialize();
                rfalSetErrorHandling(RFAL_ERRORHANDLING_NONE);
                rfalFieldOnAndStartGT();  /* Field On and Start Tp */
                rfalNfcbPollerCheckPresence(RFAL_NFCB_SENS_CMD_ALLB_REQ, RFAL_NFCB_SLOT_NUM_1, &sensRes, &sensResLen);
            }
            break;
        default:
            err = RFAL_ERR_PARAM;
            break;
    }
    return err;
}

uint8_t applProcessCyclic ( uint8_t * protocol, uint16_t * txSize, uint8_t * txData, uint16_t remainingSize )
{
    if ( counter == 0 ){ /* do not log this every time : is called cyclic */
    }
    counter++;
    *txSize = 0;
    return ST_STREAM_NO_ERROR; /* cyclic is always called, so it is no error if there is no function */
}

uint8_t applReadReg ( uint16_t rxSize, const uint8_t * rxData, uint16_t *txSize, uint8_t * txData)
{
    if(rxSize < 1) return (uint8_t)RFAL_ERR_REQUEST;

    if ( (rxData[0] & 0x80) )
    { /* virtual addresses above 0x3f provide access to test registers */
        rfalChipReadTestReg( (rxData[0] & 0x3F), txData );
    }
    else
    {
      rfalChipReadReg( rxData[0], txData, 1);
    }

    *txSize = 1;
    return 0;
}

uint8_t applWriteReg  ( uint16_t rxSize, const uint8_t * rxData, uint16_t *txSize, uint8_t * txData)
{
    uint8_t val;

    if(rxSize < 2) return (uint8_t)RFAL_ERR_REQUEST;

    val  = rxData[1];

    if ( (rxData[0] & 0x80) )
    { /* virtual addresses above 0x3f provide access to test registers */
        rfalChipWriteTestReg( (rxData[0] & 0x3F), val );
        return 0;
    }

    rfalChipWriteReg( rxData[0], &val, 1);
    return 0;
}

//***************************************************************************************
//***************************************************************************************
//***************************************************************************************
// Isodep part
static int IsoDep_DeSerialize_Info( rfalIsoDepInfo * info, const uint8_t * * ptrR)
{
    int             size = 0;
    const uint8_t * start  = * ptrR; // Kepp start value
    READ_VAL08_LE( info->FWI     , uint8_t         , * ptrR);
    READ_VAL32_LE( info->FWT     , uint32_t        , * ptrR);
    READ_VAL32_LE( info->dFWT    , uint32_t        , * ptrR);
    READ_VAL32_LE( info->SFGI    , uint32_t        , * ptrR);
    READ_VAL32_LE( info->SFGT    , uint32_t        , * ptrR);
    READ_VAL08_LE( info->FSxI    , uint8_t         , * ptrR);
    READ_VAL16_LE( info->FSx     , uint16_t        , * ptrR);
    READ_VAL32_LE( info->MBL     , uint32_t        , * ptrR);
    READ_VAL08_LE( info->DSI     , rfalBitRate     , * ptrR);
    READ_VAL08_LE( info->DRI     , rfalBitRate     , * ptrR);
    READ_VAL08_LE( info->DID     , uint8_t         , * ptrR);
    READ_VAL08_LE( info->NAD     , uint8_t         , * ptrR);
    READ_VAL08_LE( info->supDID  , bool            , * ptrR);
    READ_VAL08_LE( info->supNAD  , bool            , * ptrR);
    READ_VAL08_LE( info->supAdFt , bool            , * ptrR);
    size = * ptrR - start; // Compute nb bytes read
    return(size);
}

static int IsoDep_Serialize_Info( const rfalIsoDepInfo * info, uint8_t * * ptrW)
{
    int       size = 0;
    uint8_t * start = * ptrW;
    WRITE_VAL08_LE( info->FWI     , uint8_t         , * ptrW);
    WRITE_VAL32_LE( info->FWT     , uint32_t        , * ptrW);
    WRITE_VAL32_LE( info->dFWT    , uint32_t        , * ptrW);
    WRITE_VAL32_LE( info->SFGI    , uint32_t        , * ptrW);
    WRITE_VAL32_LE( info->SFGT    , uint32_t        , * ptrW);
    WRITE_VAL08_LE( info->FSxI    , uint8_t         , * ptrW);
    WRITE_VAL16_LE( info->FSx     , uint16_t        , * ptrW);
    WRITE_VAL32_LE( info->MBL     , uint32_t        , * ptrW);
    WRITE_VAL08_LE( info->DSI     , rfalBitRate     , * ptrW);
    WRITE_VAL08_LE( info->DRI     , rfalBitRate     , * ptrW);
    WRITE_VAL08_LE( info->DID     , uint8_t         , * ptrW);
    WRITE_VAL08_LE( info->NAD     , uint8_t         , * ptrW);
    WRITE_VAL08_LE( info->supDID  , bool            , * ptrW);
    WRITE_VAL08_LE( info->supNAD  , bool            , * ptrW);
    WRITE_VAL08_LE( info->supAdFt , bool            , * ptrW);
    size = * ptrW - start;
    return(size);
}


static ReturnCode processIsoDep(const uint8_t *rxData, uint16_t rxSize, uint8_t * txData, uint16_t *txSize)
{
    uint16_t        cmd     = (uint16_t) rxData[0];
    ReturnCode      err     = RFAL_ERR_NONE;
    const uint8_t * buf     = rxData + 1;
    uint16_t        BuffInSize = rxSize - 1;
    uint8_t         len8;
    const uint16_t  OutSizeMax = * txSize;
    uint16_t        OutSize = 0;
    if (cmd == ISODEP_CMD_COMMANDS)
    { // Extension
        cmd =  ((uint16_t) rxData[1]) + ISODEP_CMD_EXTENSION1;
        buf        = rxData + 2;
        BuffInSize = rxSize - 2;
    }

