JOKAM13/nfc_test/STEVAL-25R3916B_V2.1.0/STEVAL-25R3916B_V2.1.0/Middlewares/ST/fw_3916/DISCO-STM32L4x6/Src/dispatcher.c
    if (OutSize >= sizeof(  uint32_t))
    {
        OutSize =  sizeof(  uint32_t); // At least return ErrorCode
    }

    RFAL_MEMSET(txData, 0xff, * txSize);
    logUsart(" processIsoDep Cmd = %d: Input=%u chars output buf size=%u", cmd, rxSize, *txSize);

    err      = RFAL_ERR_PARAM; // by default
    * txSize = 0;

    switch (cmd)
    {
        case ISODEP_CMD_INITIALIZE:
            /* Configure demoboard for IsoDep. */
            rfalIsoDepInitialize();
            err     = RFAL_ERR_NONE;
            OutSize = 0;
            break;
        case ISODEP_CMD_FSXI2FSX: // uint16_t   rfalIsoDepFSxI2FSx ( uint8_t fsxi)
            OutSize = 2;
            if ( (BuffInSize == 1) && ( OutSizeMax >= OutSize) )
            {
                *((uint16_t *)txData) = rfalIsoDepFSxI2FSx (buf[0]);
                err     = RFAL_ERR_NONE;
            }
            break;
        case ISODEP_CMD_FWI2FWT: // uint32_t   rfalIsoDepFWI2FWT ( uint8_t fwi);
            OutSize = 4;
            if ( (BuffInSize == 1) && ( OutSizeMax >= OutSize) )
            {
                *((uint32_t *)txData) = rfalIsoDepFWI2FWT (buf[0]);
                err     = RFAL_ERR_NONE;
            }
            break;
        case ISODEP_CMD_PPS:
            OutSize = sizeof(rfalIsoDepPpsRes);
            if ( (BuffInSize == 3) && ( OutSizeMax == OutSize) )
            {
                err = rfalIsoDepPPS ( buf[0] /* DID*/,  (rfalBitRate) buf[1] /*DSI*/, (rfalBitRate) buf[2] /* DRI */, (rfalIsoDepPpsRes *) (txData));
            }
            break;
        case ISODEP_CMD_RATS:
            OutSize = sizeof(uint8_t)+ sizeof(rfalIsoDepAts);
            if ( (BuffInSize == 2) && ( OutSizeMax >= OutSize) )
            {   // ReturnCode rfalIsoDepRATS ( rfalIsoDepFSxI FSDI, uint8_t DID, rfalIsoDepAts * ats, uint8_t * atsLen)
                err = rfalIsoDepRATS ( (rfalIsoDepFSxI) buf[0],  buf[1] /*DID*/, (rfalIsoDepAts *) (txData + 1), (uint8_t *) (txData ));
                if (err == RFAL_ERR_NONE)
                { // Update size with relevant one, without compatibility bytes
                    OutSize = sizeof(uint8_t)+ *(uint8_t *) (txData );
                }
            }
            break;
        case ISODEP_CMD_POLLHANDLESPARAMETERS: 
            OutSize = ISODEP_DEVICE_INFO_STRUCT_SIZE;
            if ( (BuffInSize == (2U + ISODEP_DEVICE_INFO_STRUCT_SIZE) ) && ( OutSizeMax == OutSize) )
            { // Only the info part is used so only transfert in both sides this part
                rfalIsoDepDevice IsoDepDevice; // Must create an object to manage unaligned buffer
                const uint8_t *  ptrR = & buf[2];
                IsoDep_DeSerialize_Info( & IsoDepDevice.info, & ptrR);
                err = rfalIsoDepPollHandleSParameters ( & IsoDepDevice,  (rfalBitRate) buf[0] /*maxTxBR*/, (rfalBitRate) buf[1] /* maxRxBR*/ );
                if (  err == 0)
                {
                    uint8_t * ptrW = txData;
                    IsoDep_Serialize_Info( & IsoDepDevice.info, & ptrW);
                }
            }
            break;
        case ISODEP_CMD_POLLBHANDLEACTIVATION:
            OutSize = ISODEP_POLL_B_STRUCT_SIZE;
            err     =  RFAL_ERR_NOMEM;
            if ( (BuffInSize ==  0x14U ) /*4 + 4 + sizeof(rfalNfcbListenDevice) */
                && ( OutSizeMax == OutSize) )
            {
                const uint8_t* HLInfo = NULL;
                len8 =  * (buf + 4u + sizeof(rfalNfcbListenDevice) );  /* HLInfoLen */
                rfalIsoDepDevice   IsoDepDevice;
                if (len8 != 0)
                {
                     HLInfo = ( buf + 5 + sizeof(rfalNfcbListenDevice));  /* HLInfo */
                }
                err =  rfalIsoDepPollBHandleActivation (
                        (rfalIsoDepFSxI) buf[0] /*FSDI*/
                        , buf[1]                /*DID*/
                        , (rfalBitRate) buf[2]  /*maxBR*/
                        , buf[3]                /*PARAM1*/
                        , (rfalNfcbListenDevice *) (buf+4) /* nfcbDev*/
                        , HLInfo
                        , len8                  /* HLInfoLen */
                        , & IsoDepDevice
                        );
                uint8_t * ptr = txData;
                WRITE_VAL08_LE( IsoDepDevice.activation.B.Listener.ATTRIB_RES.mbliDid, uint8_t                      , ptr);
                WRITE_BUF     ( IsoDepDevice.activation.B.Listener.ATTRIB_RES.HLInfo , RFAL_ISODEP_ATTRIB_HLINFO_LEN, ptr);
                WRITE_VAL08_LE( IsoDepDevice.activation.B.Listener.ATTRIB_RESLen     , uint8_t                      , ptr);
                IsoDep_Serialize_Info( & IsoDepDevice.info, & ptr);
            }
            break;
        case ISODEP_CMD_INITIALIZEWITHPARAMS:
            OutSize = 0;
            if (BuffInSize == 7 )
            {
                rfalIsoDepInitializeWithParams
                    ( (rfalComplianceMode ) buf[0]
                    ,  buf[1] /*maxRetriesR*/
                    ,  buf[2] /*maxRetriesSnWTX*/
                    ,  buf[3] /*maxRetriesSWTX*/
                    ,  buf[4] /*maxRetriesSDSL*/
                    ,  buf[5] /*maxRetriesI*/
                    ,  buf[6] /*maxRetriesRATS*/);
                err     = RFAL_ERR_NONE;
            }
            break;
        case ISODEP_CMD_ATTRIB:
            OutSize = sizeof(uint8_t)+ sizeof(rfalIsoDepAttribRes);
            len8    =    buf[RFAL_NFCB_NFCID0_LEN + 6];  // param   HLInfoLen
            if ( (BuffInSize == (12 + len8)) && ( OutSizeMax >= OutSize) )
            {
                err = rfalIsoDepATTRIB (
                                      (uint8_t *)      buf                             /* nfcid0 */
                                    ,                  buf[RFAL_NFCB_NFCID0_LEN + 0]   /*PARAM1*/
                                    , (rfalBitRate)    buf[RFAL_NFCB_NFCID0_LEN + 1]   /* DSI */
                                    , (rfalBitRate)    buf[RFAL_NFCB_NFCID0_LEN + 2]   /* DRI */
                                    , (rfalIsoDepFSxI) buf[RFAL_NFCB_NFCID0_LEN + 3]   /* FSDI */
                                    , (uint8_t)        buf[RFAL_NFCB_NFCID0_LEN + 4]   /* PARAM3 */
                                    , (uint8_t)        buf[RFAL_NFCB_NFCID0_LEN + 5]   /* DID */
                                    , (const uint8_t *)buf + (RFAL_NFCB_NFCID0_LEN + 7)/* HLInfo*/
                                    , (uint8_t)        len8                            /* HLInfoLen */
                                    , (uint8_t)        buf[RFAL_NFCB_NFCID0_LEN + 7 + len8]   /* fwt */
                                    , (rfalIsoDepAttribRes *) txData + 1   /* attribRes */
                                    , (uint8_t *)      txData              /* attribResLen */
                );
            }
            break;
        case ISODEP_CMD_STARTAPDUTRANSCEIVE:
            OutSize = 0;
            if ( (BuffInSize >= 15) && ( OutSizeMax >= OutSize) )
            {
                const char *              pDataIn = (const char *) buf;
                rfalIsoDepApduTxRxParam   ApduParam;
                READ_VAL16_LE(ApduParam.txBufLen, uint16_t           , pDataIn);
                READ_VAL32_LE(ApduParam.FWT     , uint32_t           , pDataIn);
                READ_VAL32_LE(ApduParam.dFWT    , uint32_t           , pDataIn);
                READ_VAL16_LE(ApduParam.FSx     , uint16_t           , pDataIn);
                READ_VAL16_LE(ApduParam.ourFSx  , uint16_t           , pDataIn);
                READ_VAL08_LE(ApduParam.DID     , uint8_t            , pDataIn);
                ApduParam.txBuf    = (rfalIsoDepApduBufFormat *) pDataIn;
                ApduParam.rxBuf    = & gIsoDepApduBuffer;
                ApduParam.rxLen    = & gRcvdLen;
                ApduParam.tmpBuf   = (rfalIsoDepBufFormat *) gRxBuf; //We can use this buffer!
                pDataIn +=  ApduParam.txBufLen + RFAL_ISODEP_PROLOGUE_SIZE;
                err = rfalIsoDepStartApduTransceive ( ApduParam);
                gIsoDepTransceiveOngoing = true;
            }
            break;
        case ISODEP_CMD_POLLAHANDLEACTIVATION:
            OutSize = ISODEP_POLL_A_STRUCT_SIZE;
            err     =  RFAL_ERR_NOMEM;
            if ( (BuffInSize == 3) && ( OutSizeMax == OutSize) )
            {
                rfalIsoDepDevice IsoDepDevice;
                err = rfalIsoDepPollAHandleActivation
                        ( (rfalIsoDepFSxI) buf[0]       /* FSDI   */
                        , buf[1]                        /* DID    */
                        , (rfalBitRate) buf[2]          /* maxBR  */
                        , & IsoDepDevice);
                uint8_t * ptr = txData;
                WRITE_VAL08_LE( IsoDepDevice.activation.A.Listener.ATS.TL, uint8_t      , ptr);
                WRITE_VAL08_LE( IsoDepDevice.activation.A.Listener.ATS.T0, uint8_t      , ptr);
                WRITE_VAL08_LE( IsoDepDevice.activation.A.Listener.ATS.TA, uint8_t      , ptr);
                WRITE_VAL08_LE( IsoDepDevice.activation.A.Listener.ATS.TB, uint8_t      , ptr);
                WRITE_VAL08_LE( IsoDepDevice.activation.A.Listener.ATS.TC, uint8_t      , ptr);
                WRITE_BUF     ( IsoDepDevice.activation.A.Listener.ATS.HB, RFAL_ISODEP_ATS_HB_MAX_LEN, ptr);
                IsoDep_Serialize_Info( & IsoDepDevice.info, & ptr);
            }
            if (err != 0)
            {
                OutSize = 0;
            }
            break;
        case ISODEP_CMD_DESELECT:
            OutSize = 0;
            if ( (BuffInSize == 0) && ( OutSizeMax >= OutSize) )
            {
                err = rfalIsoDepDeselect();
            }
            break;
#if RFAL_FEATURE_ISO_DEP_LISTEN0
        case ISODEP_CMD_LISTENGETACTIVATIONSTATUS:
            OutSize = 0;
            if ( (BuffInSize == 0) && ( OutSizeMax >= OutSize) )
            {
                err = rfalIsoDepListenGetActivationStatus();
            }
            break;
        case ISODEP_CMD_ISATTRIB:
            OutSize = 1;
            len8    =  buf[0];
            if ( (BuffInSize >= 1 ) && ( BuffInSize == len8 + 1) )
            {
                * txData = rfalIsoDepIsAttrib ( buf+1,  buf[0] /*bufLen*/);
                err     = RFAL_ERR_NONE;
            }
            break;
        case ISODEP_CMD_ISRATS:
            len8 =  buf[0];
            if ( (BuffInSize >= 1 ) && ( BuffInSize == len8 + 1) )
            {
                OutSize = 1;
                * txData = rfalIsoDepIsRats ( buf+1,  buf[0] /*bufLen*/);
                err      = RFAL_ERR_NONE;
            }
            break;
#endif //  RFAL_FEATURE_ISO_DEP_LISTEN0
        case ISODEP_CMD_GETAPDUTRANSCEIVESTATUS:
            OutSize = 0;
            err     = gIsoDepTransceiveError;
            // platformLog("\nrfalIsoDepStartApduTransceive Timer %d. Status = %d rcvLen=%d",  timerCalculateTimer( 0), * pErrorCode , gRcvdLen);
            if (err == RFAL_ERR_NONE)
            {
                uint16_t len = ((uint16_t) gRcvdLen) + RFAL_ISODEP_PROLOGUE_SIZE;
                OutSize =  sizeof(uint16_t) + len;
                if (OutSize <= OutSizeMax)
                {
                    uint8_t * ptr = txData;
                    WRITE_VAL16_LE( gRcvdLen           , uint16_t      , ptr);
                    WRITE_BUF     ( & gIsoDepApduBuffer, len           , ptr);
                }
                else
                {
                    err     = RFAL_ERR_NOMEM;
                }
            }
            break;
        case ISODEP_CMD_GETTRANSCEIVESTATUS:
            OutSize = 0;
            if ( (BuffInSize == 0) && ( OutSizeMax >= OutSize) )
            {
                err = rfalIsoDepGetTransceiveStatus ();
            }
            break;
        case ISODEP_CMD_GETMAXINFLEN:
            OutSize = 2;
            if ( (BuffInSize == 0) && ( OutSizeMax >= OutSize) )
            {
                uint16_t res = rfalIsoDepGetMaxInfLen ();
                WRITE_VAL16_LE( res, uint16_t      , txData);
                err     = RFAL_ERR_NONE;
            }
            break;

         // Operation on Flash for persistent Analog Config
        case CMD_EXT_PERSISTENT_ANALOG_CONFIG:
            OutSize = 0;
            if ( (BuffInSize >= 1) && ( OutSizeMax >= OutSize) )
            {
                bool      status   = false;
                uint8_t * ptr      = txData;
                uint16_t  size;
                uint8_t   tmpbuf[RFAL_ANALOG_CONFIG_TBL_SIZE];
                err = RFAL_ERR_NONE;
                switch(   buf[0]) // buf[0] contains the command id 
                {
                    case PERSISTENT_ANALOG_CONFIG_WRITE:
                        // Install persistent
                        status = (persistentAnalogConfig_Program( ) == RFAL_ERR_NONE ? true : false);
                        break;
                    case PERSISTENT_ANALOG_CONFIG_CRC:
                    {
                        uint32_t  crcOriginal32;
                        uint32_t  crcStored32;
                        uint32_t  crcCurrent32;
                        // Retrieve current RFAL AC Table from RAM
                        rfalAnalogConfigListReadRaw( tmpbuf, sizeof(tmpbuf), & size );
                        // retreive now 32 bits CRCs
                        persistentAnalogConfig_GetHash(& crcOriginal32, & crcStored32);
                        // Retrieve current RFAL AC Table from RAM
                        crcCurrent32 = persistentAnalogConfig_CalcHash( tmpbuf, size );    // Compute checksum
                        WRITE_VAL32_LE( crcOriginal32, uint32_t , ptr);
                        WRITE_VAL32_LE( crcStored32  , uint32_t , ptr);
                        WRITE_VAL32_LE( crcCurrent32 , uint32_t , ptr);
                        WRITE_VAL32_LE( (CRC_32bits_FNV1a  | CRC_Original | CRC_Stored | CRC_Current), uint32_t , ptr);
                        OutSize = 16;
                        status  = true;
                        break;
                    }
                    case PERSISTENT_ANALOG_CONFIG_ERASE:
                        // status = persistentAnalogConfig_Erase();
                        err     = RFAL_ERR_NOT_IMPLEMENTED; // Should not erase in this version
                        break;
                    default:
                        status = true;
                        err     = RFAL_ERR_NOT_IMPLEMENTED; // Should not erase in this version
                        break;
                }
                if (status != true)
                    err =  RFAL_ERR_NOMEM;
            }
            break;
        default: // non implemented Isodep commands
            err     = RFAL_ERR_NOT_IMPLEMENTED;;
            break;
    }
    if ( err != RFAL_ERR_NONE)
    {
        * txSize = 0;
    }
    else
    {
        if (OutSize <= OutSizeMax)
        {
            * txSize = OutSize;
        }
        else
        {
            err      = RFAL_ERR_PARAM;
            * txSize = 0;
        }
    }
    return err;
}

//***************************************************************************************
//***************************************************************************************
//***************************************************************************************
//***************************************************************************************
//***************************************************************************************
const uint32_t firmwareNumber = 0x010404;

const char * applFirmwareInformation(void)
{
#ifdef _NUCLEO_
  #ifdef ST25R3916B
    return "ST25R3916B-DISCO (NUCLEO) Firmware v1.4.4";
  #else
    return "ST25R3916-DISCO (NUCLEO) Firmware v1.4.4";
  #endif
#else
  #ifdef ST25R3916B
    return "ST25R3916B-DISCO (MB) v1.4.4";
  #else
    return "ST25R3916-DISCO (MB) v1.4.4";
  #endif
#endif
}
